{"paragraphs":[{"text":"%pyspark\ndf = spark.read.json(\"/home/zafrin/PycharmProjects/RateMyProfessor/data/raw/reviews_old_play.json\")","user":"anonymous","dateUpdated":"2018-07-30T22:08:04-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"runtimeInfos":{"jobUrl":{"propertyName":"jobUrl","label":"SPARK JOB","tooltip":"View in Spark web UI","group":"spark","values":["http://10.0.1.109:4040/jobs/job?id=8"],"interpreterSettingId":"spark"}},"apps":[],"jobName":"paragraph_1532802449278_-881880593","id":"20180728-142729_2020133553","dateCreated":"2018-07-28T14:27:29-0400","dateStarted":"2018-07-30T22:08:04-0400","dateFinished":"2018-07-30T22:08:04-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8035"},{"text":"%pyspark\ndf.createOrReplaceTempView('exampledf')","user":"anonymous","dateUpdated":"2018-07-30T22:24:40-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"apps":[],"jobName":"paragraph_1533003691446_-1225904224","id":"20180730-222131_1398176794","dateCreated":"2018-07-30T22:21:31-0400","status":"FINISHED","progressUpdateIntervalMs":500,"focus":true,"$$hashKey":"object:11394","dateFinished":"2018-07-30T22:24:40-0400","dateStarted":"2018-07-30T22:24:40-0400","results":{"code":"SUCCESS","msg":[]}},{"text":"%sql\nselect * from exampledf","user":"anonymous","dateUpdated":"2018-07-30T22:26:13-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{"0":{"graph":{"mode":"multiBarChart","height":300,"optionOpen":false,"setting":{"table":{"tableGridState":{},"tableColumnTypeState":{"names":{"_corrupt_record":"string","attendence":"string","class_names":"string","comments":"string","date":"string","for_credits":"string","grades_revieved":"string","level_of_difficulty":"string","overall_quality":"string","prof_id":"string","rating_type":"string","tags_by_user":"string","textbook_used":"string","thumbs_down":"string","thumbs_up":"string","would_take_again":"string"},"updated":false},"tableOptionSpecHash":"[{\"name\":\"useFilter\",\"valueType\":\"boolean\",\"defaultValue\":false,\"widget\":\"checkbox\",\"description\":\"Enable filter for columns\"},{\"name\":\"showPagination\",\"valueType\":\"boolean\",\"defaultValue\":false,\"widget\":\"checkbox\",\"description\":\"Enable pagination for better navigation\"},{\"name\":\"showAggregationFooter\",\"valueType\":\"boolean\",\"defaultValue\":false,\"widget\":\"checkbox\",\"description\":\"Enable a footer for displaying aggregated values\"}]","tableOptionValue":{"useFilter":false,"showPagination":false,"showAggregationFooter":false},"updated":false,"initialized":false},"stackedAreaChart":{"rotate":{"degree":"-45"},"xLabelStatus":"default"},"lineChart":{"rotate":{"degree":"-45"},"xLabelStatus":"default"},"multiBarChart":{"rotate":{"degree":"-45"},"xLabelStatus":"default"}},"commonSetting":{},"keys":[{"name":"_corrupt_record","index":0,"aggr":"sum"}],"groups":[],"values":[{"name":"attendence","index":1,"aggr":"sum"}]},"helium":{}}},"editorSetting":{"language":"sql","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/sql"},"settings":{"params":{},"forms":{}},"apps":[],"jobName":"paragraph_1533003883760_-1822257546","id":"20180730-222443_1946873849","dateCreated":"2018-07-30T22:24:43-0400","status":"FINISHED","progressUpdateIntervalMs":500,"focus":true,"$$hashKey":"object:11485","dateFinished":"2018-07-30T22:25:38-0400","dateStarted":"2018-07-30T22:25:37-0400","results":{"code":"SUCCESS","msg":[{"type":"TABLE","data":"_corrupt_record\tattendence\tclass_names\tcomments\tdate\tfor_credits\tgrades_revieved\tlevel_of_difficulty\toverall_quality\tprof_id\trating_type\ttags_by_user\ttextbook_used\tthumbs_down\tthumbs_up\twould_take_again\n[{\"prof_id\": 100001, \"date\": \"12/14/2017\", \"rating_type\": \"good\", \"overall_quality\": \"4.0\", \"level_of_difficulty\": \"3.0\", \"class_names\": \"SOC106\", \"for_credits\": \" Yes\", \"attendence\": \" Mandatory\", \"textbook_used\": \" No\", \"would_take_again\": \" Yes\", \"grades_revieved\": \" N/A\", \"tags_by_user\": [\"CARING\", \"RESPECTED\", \"GET READY TO READ\"], \"comments\": \"Clawson is really caring and interested in his students so it's an easy class to pass, although there is A LOT of reading which is important to quizzes (a pretty big part of your grade) and the final exam. There's a big paper but its very doable and Dan is very easy to work with. Lectures get a bit tedious but can be though provoking\", \"thumbs_up\": \"0\", \"thumbs_down\": \"0\"},\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\tnull\nnull\t Mandatory\tSOC353\tThis class was definitely not what I thought it would be. Heavily reading based. If you read the articles you'll be fine and he gives you opportunities to miss some of the reaction papers he assigns. The book essay is a big part of your grade: START IT EARLY! Overall he's an okay teacher but kind of boring and the class is not based on medications.\t11/15/2017\t N/A\t B\t3.0\t3.0\t100001\taverage\tWrappedArray(CLEAR GRADING CRITERIA, PARTICIPATION MATTERS, GET READY TO READ)\t Yes\t0\t1\t No\nnull\t Not Mandatory\tSOC106\tThis class sucks. don't take it. you will regret it.\t10/16/2017\t Yes\t N/A\t4.0\t1.0\t100001\tawful\tWrappedArray()\t Yes\t0\t0\t No\nnull\t N/A\t442\tDan is best. I really recommend this class if you are interested in the health field or just want an awesome class.\t12/11/2014\t Yes\t N/A\t3.0\t4.5\t100001\tawesome\tWrappedArray(PARTICIPATION MATTERS, GIVES GOOD FEEDBACK, INSPIRATIONAL)\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC335\tWonderful professor, inspired great interest in the subject. One of the best professors I've had.\t05/16/2014\t N/A\t N/A\t2.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOCIOL442\tClass was ok. Had an option to complete a certain # out of total assignments. Was always pushing deadlines back. He did tell me it was ok to take on a topic that has yet to be researched, went thru ideas for the paper, told me i needed to find research on it on graded last edit? that was a bit annoying. Nice guy. not very interesting. dont avoid\t01/20/2014\t N/A\t N/A\t2.0\t4.5\t100001\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSOC322\tWell I did learn a lot and enjoyed most of the readings. We had three papers and an optional final. All of class is just one big lecture with a small group of students that always participate. One time he was heading towards a biological determinism argument (crazy I know), and I think that was the highlight of my experience as a sociology major ha\t01/18/2014\t N/A\t N/A\t3.0\t4.5\t100001\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSOC106\tHe has his agenda like so many others here. And though he appears to be erudite, he cannot help but be married to his radical politics. Well this is UMass at Amherst. I cannot wait to get into classes about reality.\t12/28/2010\t N/A\t N/A\t1.0\t2.5\t100001\taverage\tWrappedArray()\t Yes\t5\t4\t N/A\nnull\t N/A\tSOC106\tDan is an awesome professor, so intelligent.  I was both a student in his class and a TA for him as well.  He's very reasonable.  Although there is heavy reading in the course, they are for the most part very interesting. Make friends with your TA!!...Dan gives total power to his TA's in deciding grades, extensions, etc.\t04/03/2010\t N/A\t N/A\t4.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tInteresting subject but very scattered and biased method of teaching. Barely took any notes. Weekly 1pg response papers due, 4 unit papers (only have to do 3), optional final, 6 pop quizzes drops the lowest. If you muddle through the not always pleasant reading material and incorporate the \"4 key concepts\" in your writing then you should be fine.\t01/10/2010\t N/A\t N/A\t4.0\t3.0\t100001\taverage\tWrappedArray()\t Yes\t1\t1\t N/A\nnull\t N/A\tSOCIO106\thorrible class. DONT take it.  dan doesn't talk about anything real during class, just rambles on about his opinion on stuff and then will give you random facts to write down so you can write the essays well. paper due every week, do all of them. and id write all the essays so that you can get a good grade. go to class because of random quizzes.\t12/30/2009\t N/A\t N/A\t5.0\t2.0\t100001\tpoor\tWrappedArray()\t No\t1\t0\t N/A\nnull\t N/A\tSOC106A\tThis is one class I actually don't mind going to. Most of the books you have to read are decent and the class is actually interesting. The papers are a pain but doable. You pretty much have to go to class bc there are 6 in class pop quizzes, but they're really easy if you do the reading.\t12/02/2009\t N/A\t N/A\t2.0\t3.5\t100001\tgood\tWrappedArray()\t Yes\t1\t0\t N/A\nnull\t N/A\tSOC106A\tvery smart prof & interesting lectures that basically talk about the reading assigned the night before to help you understand exactly how it relates to class. weekly 1pg writing not very hard, papers suck but not impossible. no text book just had small books to read for each unit.. great class over all highly recommended :)\t11/23/2009\t N/A\t N/A\t4.0\t4.5\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC100\tOne of the most intelligent teachers I've ever had\t10/02/2009\t N/A\t N/A\t3.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOCIO442\tAmazing guy & Professor! Course material super interesting, highly recommend this course & anything he teaches. Weekly writing statements (pretty easy),midterm essay questions (ques. told in advance),2 papers, final take-home exam -> Overall probably the best course I've taken at Umass and in Soc dept course reccom to soc majors,premeds, & anyone!!\t03/27/2009\t N/A\t N/A\t3.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC442\tREALLY nice guy, the course material is sort of hard to grapple with, but if you make an effort and show up to class, he's very helpful and understanding. Decent course but really great professor.\t01/06/2009\t N/A\t N/A\t3.0\t3.0\t100001\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tLectures can be boring and the papers are a drag, but the final is optional. Easy to get an A or B\t01/05/2009\t N/A\t N/A\t2.0\t4.0\t100001\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tgood teacher.\t01/01/2009\t N/A\t N/A\t3.0\t4.0\t100001\tgood\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSOC106\tLoved this class! The four 5 page papers were a drag, but I only wrote 2 and took the final and got three high As. Very opinionated, but if you agree with him it is fabulous! He has a lot of great insight and stories to tell. Take a class with him before you leave UMass!\t12/20/2008\t N/A\t N/A\t3.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tmy suggestion would be to avoid taking this class at all costs. clawson drags lectures on and on, and is a kind of a jerk. there are 6 pop quizzes so while going to class is worse than watching your grandma clip her toenails, it's kind of necessary since you don't know when there will be a quiz. the only upside is not having to take the final.\t12/18/2008\t N/A\t N/A\t3.0\t1.5\t100001\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tGoing to one of Dan's classes is like entering off-the-charts liberal territory. He is very fierce about his opinions and incorporates them into the &quot;facts&quot; he chooses to teach us about. Totally dogmatic and wanting of a bloody socialist revolution.\t12/16/2008\tN/A \t N/A\t2.0\t3.0\t100001\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tProfessor Clawson (or &quot;Dan&quot;, as he insists we call him since he believes titles are social construction) is an easy A, but a frustrating one. No need to attend the lectures, since each one is the same rambling of his own personal opinion incorporated into what is otherwise common knowledge. Suffocatingly gung-ho about how oppressive The Man is.\t11/04/2008\tN/A \t N/A\t1.0\t2.0\t100001\tpoor\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSOC106\tOpinionated, however, generated interest in material presented. Lots of reading. Can either write 2 papers and take final or write 3 papers and not have to take the final. Gives lots of extra credit, make sure to capitalize on the easy points. Requires work, but is managable to get an A.\t01/17/2008\tN/A \t N/A\t3.0\t3.0\t100001\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOCIO106\tDan is a pretty good guy, but he goes on and on about his opinions, and you have to wonder if it has any relevance to the class. Never go. You go and you'll be bored to death. I'm pretty sure you'll know everything the course has for you. There is a lot of extra credit...so if you want an easy GenEd, then maybe but good luck staying awake.\t11/26/2007\tN/A \t N/A\t2.0\t2.0\t100001\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tHis liberal views are absolutely not an issue- he is very fair and open to what other people think.\t11/26/2007\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tVery nice professor. The class is interesing, and a quick way to get rid of geneds. The grading policy is VERY generous- if you do poorly in this class you have no one to blame but yourself. The class has 4 sections, so you get a decent intro to some main topics in sociology.\t11/26/2007\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOCIO106\tFantastic Class! Dan is openminded and enthusiastic. Yeah he's liberal but he welcomes all opinions. He has the *best* grading system. It's fair and there's room for error. If you do the readings you will pass with flying colors. The material is interesting and Dan keeps lectures from being boring. I especially recommend this to incoming freshman.\t01/29/2007\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\ti loved this class. the books were great and very opening and so was he. politically speaking, he really opened my eyes. I also loved my discussion section. The topics and conversation was good although it wasn't diverse at all. I was actually a TA for this course and really enjoyed it.\t01/28/2007\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC335\tDan is sick. I read the comments on this site and I have to say that the liberal agenda people talking about simply wasn't an issue. He tells you flat out first day its his personal view but from there he was fairly objective pointing out mistakes by &quot;Liberals&quot; you can get an A in your sleep you just need to earn 94 out of a possible 186 points.\t12/19/2006\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\tI agree the man is very passionate about his views, throws in a joke knocking Bush every once in a while. Don't do anything on your laptop except take notes he likes to wander around checking laptops screens. Read the books and i recommend you do papers instead of the final. He gives e-reserves readings which are terribly long. My dicussion=useless\t12/14/2006\tN/A \t N/A\t2.0\t4.0\t100001\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSOC106\ti didn't like this class at all. you'll find that he's very opinionated and thinks he's always right no matter what. the class didn't interest me at all. he wasn't that helpful either. and sorry to say that the discussion teacher i had was bad too didn't speak english and was often unorganized.\t07/18/2006\tN/A \t N/A\t3.0\t2.0\t100001\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tGreat class! very easy, probably one of the easiest here at UMASS. He is very interested in what he teaches and it shows. His liberal agenda can get overwhelming through his lectures, except its highly entertaining..final not required if you do papers and can get through with very little work..go to discussion sections; they help a lot.\t12/19/2005\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tGreat Professor. Can get a little soapboxy but if you agree with him you'll love it. Really loves what he's talking about.\t12/03/2005\tN/A \t N/A\t2.0\t4.0\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tI'm not loving this class, but its good. he does really love what he's teaching. you dont ever need to go to class, but if you do go youre never bored, he's very good at keeping you interested. he's very passionate, but it kinda sucks if you disagree with him. dont disagree with him in your papers or youll get a bad grade!\t12/03/2005\tN/A \t N/A\t4.0\t3.0\t100001\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tSOC106\the likes to get in ur face\t11/30/2005\tN/A \t A\t2.0\t4.0\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOCIOLOGY106\tVery passionate about his area of teaching...don't really need to go to class because he gives you the syllabus on the first day...go to the discussions and do your papers and its an easy gen ed..no final if you do 3 out of the 4 papers\t11/28/2005\tN/A \t N/A\t1.0\t4.5\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOCIOLOGY106\tNo Comments\t09/22/2005\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOCIOLOGY\tgreat professor!! really into what hes doing..\t09/12/2005\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOCIOLOGY106\tThis guy is the best, the class is so interesting and he has extremely interesting views, dont be afraid to disagree with him but he will push his views.....good gen ed\t04/27/2005\tN/A \t N/A\t3.0\t4.5\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tNo Comments\t04/24/2005\tN/A \t N/A\t2.0\t2.5\t100001\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106X\tAn interesting class and I agree with most of what he says, but he really straddles the line between revealing his personal politics and trying to hard to convert you. A bit of a preacher rather than a teacher\t03/23/2005\tN/A \t N/A\t3.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tLABOR\tNo Comments\t12/14/2004\tN/A \t N/A\t3.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOCIO293HIED\tClawson is awesome. Take this course if you like to get involved. So easy to get an A and there is not much work do for it and such an interesting subject, it focuses on UMass and Massachusetts. Definitely recommend it.\t11/12/2004\tN/A \t N/A\t1.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tHIGHERED\tDan was a bit crabby this semester. Thank god i didn't have him as a discussion teacher. If you can get one of his TA's for a discussion teacher. Lots of ways you can earn an A in this couse. No tests, just a take home exam that you do even have to do.\t05/18/2004\tN/A \t N/A\t4.0\t2.0\t100001\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC293C\tThis course would be great if you could think other than he does. All he ever says is how little the tenure staff is getting paid and how they are spending TOO MUCH TIME IN THE CLASSROOM and not enouth on research. Too much time&#63;\t04/30/2004\tN/A \t N/A\t3.0\t1.5\t100001\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t363C\tHe is very active in social movements and took us on a trip to The State house in Boston to lobby for increasing funds for Umass AMherst! Great guy !\t04/26/2004\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\twe read really good books in this class\t06/27/2003\tN/A \t N/A\t3.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tIf you are not liberal, I wouldn't suggest taking this course...he rufuses to listen to others opinions if they don't coincide with his own! easy gen. ed requirement!\t06/01/2003\tN/A \t N/A\t2.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tNo Comments\t05/17/2003\tN/A \t N/A\t3.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tAwesome professor. very knowledgeable, lectures frame the books well. no test. If you do the reading an A is easy. You will also learn a lot\t05/07/2003\tN/A \t N/A\t1.0\t5.0\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t106\tClass itself could have been really interesting and informative, but because i found this prof to be so annoying and arrogant, i didn't attend class...but the course itself is easy\t04/21/2003\tN/A \t N/A\t2.0\t2.5\t100001\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC335\tA nice guy, but does not get course materials across. No substance to the class, just uninformative discussions. Topics topics not that interesting.\t04/17/2003\tN/A \t N/A\t3.0\t3.5\t100001\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tvery influential class\t02/22/2003\tN/A \t N/A\t3.0\t4.5\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC335\tNo Comments\t02/05/2003\tN/A \t N/A\t3.0\t4.5\t100001\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSOC106\tNo Comments\t01/10/2003\tN/A \t N/A\t5.0\t1.0\t100001\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tPOLS350\tShe is a tough marker but she gives feedback and will explain. Loads of reading. Need to show up and participate because of 20% of your mark... No texts however only mini reading responses of 500 words.\t10/14/2014\t Yes\t Not sure yet\t3.0\t2.5\t100004\taverage\tWrappedArray(PARTICIPATION MATTERS, TOUGH GRADER, GET READY TO READ)\t Yes\t1\t0\t N/A\nnull\t N/A\tWST410\tWicked good prof... the kind that you would pay for even if you didn't get any credits for it... She kinda helped to change my whole life; thanks Cressida\t07/05/2010\t N/A\t N/A\t4.0\t4.5\t100004\tawesome\tWrappedArray()\t Yes\t1\t0\t N/A\nnull\t N/A\tPHIL272\tHard marker, assignments fair, no final. Course material very engaging and changes your views of the world.\t04/21/2010\t N/A\t N/A\t4.0\t5.0\t100004\tawesome\tWrappedArray()\t No\t1\t1\t N/A\nnull\t N/A\tPHIL272\tThis class will change how you look at the world. Dr.H challenges you think very hard (be expected to really apply yourself...this is a THINKING course). The amount of reading was reasonable, but alot of critical examination after. Hard marker, but reasonable. LOTS of writing in this class - no m/c or any kind of easy stuff. Class is illuminating!\t10/31/2006\t N/A\t N/A\t4.0\t5.0\t100004\tawesome\tWrappedArray()\t Yes\t1\t1\t N/A\nnull\t N/A\tPHIL332\tThe best teacher I have ever had.  So engaging, entertaining and helpful.\t10/01/2006\t N/A\t N/A\t4.0\t5.0\t100004\tawesome\tWrappedArray()\t Yes\t1\t1\t N/A\nnull\t N/A\tVARIOUSPHIL\tHaving taken several courses with Cressida, I can honestly say that she's one of the most inspirational and intellectually challenging profs at the U. Brilliant, hilarious, and compassionate - a winning combination. She's the prof that will change your worldview.\t05/02/2005\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHIL101\tIncredible! Passionate, engaging and easy to learn from.  She is an inspiration and a once-in-a-lifetime kind of teacher, if you can take a class from her, DO!\t04/26/2005\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHIL300\tAmazing. In four years, perhaps the best prof I'd ever had. The kind that can change your life. Thanx Cressida.\t03/30/2005\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\t101\tVery funny with cute english accent. Really organized and makes the material interesting.\t11/26/2004\t N/A\t N/A\t5.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHIL101\tGreat teacher. Loves her subject and it shows. A pleasure to listen to, basically the only reason why I attend school at all is to listen to her lecture.\t11/10/2004\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHLWST332\tBrilliant and totally hot. She was one of my favourite profs and is an all around wonderful woman. She did shut up some people in class, but only because they were offensive, ridiculous and wasting the rest of the class' time. I recommend any class she teaches. Go Cressida!\t11/06/2004\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHIL332\texhibits a rare passion and skill for teaching that is matched only by her formidable intellect.\t07/29/2004\t N/A\t N/A\t4.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL5\tShe tries to control everything in the class and shuts up people if she does not like their opinion.  Not a good strategy in graduate-level courses.\t10/21/2003\t N/A\t N/A\t3.0\t1.0\t100004\tawful\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tFEMINISM\tI had her when she taught at Michigan State and I thought she was great.\t08/29/2003\t N/A\t N/A\t3.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tShe's really cool and an excellent teacher\t12/15/2002\t N/A\t N/A\t2.0\t5.0\t100004\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tFIN440\tGreat guy, but makes the course very tough. Gives you weekly homework which is not bad, but then the exams do not contain anything from the homework, they are just from his really long lecture notes. Not the most interesting class.\t05/04/2018\t Yes\t B\t4.0\t3.0\t100006\taverage\tWrappedArray(ACCESSIBLE OUTSIDE CLASS, CLEAR GRADING CRITERIA, LECTURE HEAVY)\t No\t0\t1\t No\nnull\t Mandatory\tFINA311\tHe'll provide more info on tests and topics if you ask. Knows his stuff and the in class discussions are enjoyable. Do the homework and study well. Some extra credit opportunities on tests.\t12/11/2017\t Yes\t C\t4.0\t4.0\t100006\tgood\tWrappedArray(ACCESSIBLE OUTSIDE CLASS, LECTURE HEAVY)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tFIN311\tTests are 75% of your grade, if you are willing to go to him for help then you will be okay.  He does want his students to pass, so ASK questions.  Really do not be afraid to ask questions, and do the additional problems he puts on myclasses.  He does do like one extra credit event.\t03/29/2017\t Yes\t N/A\t3.0\t4.0\t100006\tgood\tWrappedArray(TEST HEAVY, SKIP CLASS? YOU WON'T PASS., GIVES GOOD FEEDBACK)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tFIN311\tThis class in general is very difficult but this professor didn't help at all. Limited office hours, no extra credit and your grade is 75% exams.  homework is 25%. He expects you to read each chapter 4 times, and come with questions. Wont tell anyone what is on the exams. If you don't ask, he doesn't tell. Will make you feel dumb for asking ?'s\t01/04/2017\t Yes\t B+\t1.0\t1.0\t100006\tawful\tWrappedArray(TEST HEAVY, TOUGH GRADER, LOTS OF HOMEWORK)\t Yes\t1\t1\t No\nnull\t Mandatory\tFIN311\tI don't know if it is him or the class itself but it's VERY difficult. Makes you feel stupid when asking questions and poor office hour times.\t11/16/2016\t Yes\t N/A\t5.0\t2.0\t100006\tpoor\tWrappedArray(GET READY TO READ, SKIP CLASS? YOU WON'T PASS.)\t Yes\t0\t0\t No\nnull\t Mandatory\tFINA311\tHe's great! Take him if you have problems in Math as he will explain everything. Homework is due about every week over the online access. Exams are open book, open notes but not to take lightly. He grades nicely, if you are on the right track, he'll give you a lot of points. I would recommend to take him if you have heard \"the bad\" about FINA 311.\t11/03/2015\t Yes\t N/A\t4.0\t5.0\t100006\tawesome\tWrappedArray(GIVES GOOD FEEDBACK, SKIP CLASS? YOU WON'T PASS., LOTS OF HOMEWORK)\t Yes\t1\t1\t N/A\nnull\t N/A\tFINA440\tErvin's a good guy but he is challenging. You will have to work and re-work his problems before the test and he likes to throw curveballs in there. Homework is worth 28% of the final grade though and is pretty easy. Managed to get a C in the class without killing myself\t05/17/2012\t N/A\t N/A\t3.0\t3.5\t100006\tgood\tWrappedArray()\t No\t2\t2\t N/A\nnull\t N/A\tFINA440\tHomework is completely irrevelant to the exams, but it does help boost your grade. Exams are straight from lecturers, you're allowed to have a formula sheet double sided but his exams still seem to stump everybody. Willing to help you but he expects you to know everything. You sink or You swim.\t05/15/2012\t N/A\t N/A\t3.0\t3.0\t100006\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tFINA440\tDO NOT TAKE! As the poster below me said, his exams are IMPOSSIBLE. I studied a minimum of 10 hours for each exam and am struggling to hold a C. Dont bother asking him whats on the exam, he will just send the class an email listing the names of the chapters covered. He doesn't care if people fail and does little to help those struggling.\t05/16/2011\t N/A\t N/A\t5.0\t1.0\t100006\tawful\tWrappedArray()\t Yes\t0\t2\t N/A\nnull\t N/A\tFINA440\tThis guy is a joke!!! Over half of the class is going to get a D or lower for their final grade and he thinks thats a good thing....will never give a student an A its one of his policies, test are impossible and admits to making them that way on purpose...worst part is he is the only teacher that teaches this class!\t05/12/2011\t N/A\t N/A\t5.0\t1.0\t100006\tawful\tWrappedArray()\t No\t0\t2\t N/A\nnull\t N/A\tFINA420\tErvin is ridiculous! He might be nice in class and seem helpful but his tests are the hardest I have ever had. I'm an A student and got a C in the class after doing all the homework, going to EVERY class, and studying a ton. Studied forever for the final and still failed! Cheat sheets don't help. Good luck.\t01/18/2011\t N/A\t N/A\t5.0\t1.5\t100006\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tFIN440\tTests are rediculous. Cheat sheets dont help because he  has stuff on tests that you have never seen before. Sucks at teaching/and tries to fail everyone\t10/04/2010\t N/A\t N/A\t4.0\t2.0\t100006\tpoor\tWrappedArray()\t Yes\t0\t1\t N/A\nnull\t N/A\tFINA440\tErvin is a good guy, but this class is very challenging. I am an 'A/B' student in the business school but I got a 'C' in this course.  The homework is easy in the beginning but get harder as the semester continues.  I studied at least 24 hours for the final and still failed. Attend class, ask for help.\t06/02/2010\t N/A\t N/A\t5.0\t3.5\t100006\tgood\tWrappedArray()\t Yes\t0\t1\t N/A\nnull\t N/A\tFINA442\tWorst finance Professor at Salisbury. Class isnt too boring but you will not learn anything. Each test, more than 90% of the class did not finish on time. He says lazy things like how him grading your work makes him deserve teacher of the year. Do Not Take him.\t05/05/2009\t N/A\t N/A\t5.0\t1.0\t100006\tawful\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tFINA440\tWorst prof. graduating...actually believes too many Finance degrees are awarded at SU.  Likes to fail half the class.\t01/27/2009\t N/A\t N/A\t5.0\t1.0\t100006\tawful\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tFINA440\tNever take this professor. He lets you have a page for exams to write down anything you want, but it doesnt help because tests are designed to confuse you, my class avg for the 1st test was a 28% and the extra credit offered due to this was hrs worth of hw for a max of 2%. No point going to class because you usually will spend the time watching TV.\t12/27/2008\t N/A\t N/A\t4.0\t1.0\t100006\tawful\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tFINA311\tgood professor but his tests are much harder than others out there.  problems on tests are difficult and advanced as if everyone in the class is upper level finance major.  doesnt explain well - had to teach it to myself.  try to take someone else, but if you get ervin its not the end of the world.  problem is you need C to get credit - hard to do.\t12/16/2008\t N/A\t N/A\t5.0\t3.5\t100006\tgood\tWrappedArray()\t Yes\t0\t1\t N/A\nnull\t N/A\tFINA311\tTake him over winter or summer and you will get to use cheat sheets. On those cheat sheets put all of your hw mngr problems and step by step how to do them. Learn to use your calculator. Tests are 1/2 homework type problems MC answer and 1/2 theory MC. Its not easy, but I like finance, I got an A, most people got C's. He doesnt explain that well.\t01/25/2008\t N/A\t N/A\t3.0\t2.5\t100006\taverage\tWrappedArray()\t No\t0\t1\t N/A\nnull\t N/A\tFINA440\tNice guy and very willing to help you understand but for me, clarity in lectures could be way better. I had to learn everything from the book rather than from him.\t08/28/2006\t N/A\t N/A\t2.0\t3.5\t100006\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCORPFIN\thard ass tests; unclear lectures\t03/13/2006\t N/A\t N/A\t5.0\t2.0\t100006\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA440\tHe gives hard test but is willing to take the time to review any problems you have. Ask to go over problems with him and you'll do fine. You will need to study a lot for his exams.\t11/11/2005\tN/A \t N/A\t3.0\t3.0\t100006\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA440\tI liked him. Learned a lot. And he's a nice guy.\t05/22/2005\tN/A \t N/A\t2.0\t3.5\t100006\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA\tGood guy.. Helps as much as possible\t04/22/2005\tN/A \t N/A\t2.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tGreat Professor. Really cares about the students and goes out of his way to help everyone understand.\t01/20/2005\tN/A \t N/A\t3.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFIN311\tI loved this professor to death. He was very helpful. If you needed help all you have to do was go to his office and he would help you. He would not let you leave if you did not understand. I had heard that this class was so hard but Professor Ervin made it so easy.\t01/08/2005\tN/A \t N/A\t2.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tFINA440\tHe wasn't as hard as I had heard. Easy grader\t11/22/2004\tN/A \t N/A\t2.0\t3.5\t100006\tgood\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tFIN311\tHe has a great smile and is a great guy great teaching and fair grades Gives all the formulas all u need is to plug it in. Hard&#63; I don't think so.\t11/08/2004\tN/A \t N/A\t3.0\t4.5\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tGreat class\t04/11/2004\tN/A \t N/A\t3.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tI had him for 311 which all students in the business school have to take. He taught the class like everyone in there was a finance major. The class was really hard (68% average on tests). If I hear about Duke Energy one more time I'll snap.\t03/17/2004\tN/A \t N/A\t4.0\t2.0\t100006\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tMoves way to fast and when you ask him to slow down he speeds up it seams\t11/19/2003\tN/A \t N/A\t4.0\t2.0\t100006\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tHe wants you to learn finance so learn finance. He will be as helpful and clarify as much as you need just learn finance. Business experience.\t10/31/2003\tN/A \t N/A\t3.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA440\tNo Comments\t03/14/2003\tN/A \t N/A\t4.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA440\tterrible, hes clueless most of the time, Duke energy this Duke energy that,\t03/12/2003\tN/A \t N/A\t5.0\t1.0\t100006\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tVery Helpful. Knows his stuff. Tests are challenging, just go to class\t02/20/2003\tN/A \t N/A\t2.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA311\tTake this guy if you want to learn finance\t02/13/2003\tN/A \t N/A\t4.0\t5.0\t100006\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA3114\tReads from power point slides, quizes are easy, but tests are extemely hard\t12/15/2002\tN/A \t N/A\t4.0\t3.0\t100006\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINA3114\tReads from power point slides, quizes are easy, but tests are extemely hard\t12/15/2002\tN/A \t N/A\t4.0\t2.0\t100006\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tPOLS299\tDavid is a really genuine person. He wants you to succeed and it really shows.  Although he makes you work hard, his knowledge reaches far and wide and he has a lot to share.  Take this class if you get a chance! Really inspirational and moving.\t01/19/2017\t Yes\t N/A\t4.0\t5.0\t100008\tawesome\tWrappedArray()\t No\t1\t1\t Yes\nnull\t N/A\tPHIL270\tHe is a Propagandist. People take a liking to him because he is articulate and soft spoken. His Phil270 course was all socialist, from Marx to radical feminist C. MacKinnon.  He stopped group discussions because the female (oppressed) members were not getting their fair share of time. Masked socialist ideals with democracy and citizenship drivel.\t03/06/2014\t N/A\t N/A\t3.0\t3.5\t100008\tgood\tWrappedArray()\t Yes\t4\t5\t N/A\nnull\t N/A\tPOLS299\tIf your a philosophy type, this is probably your man. I, however, am not. Had him for a political science class and loathed every single second of it (especially the mandatory meditation sessions). Far too pompus and flaky to be teaching pols.\t09/09/2010\t N/A\t N/A\t3.0\t3.0\t100008\taverage\tWrappedArray()\t Yes\t1\t0\t N/A\nnull\t N/A\tPHIL101\tSO much work, but SO worth it. I couldn't agree more..Kahane is the best prof i ever had in my first year, and i have yet to meet one better, or even comparable for that matter! the material is thrilling, the TA's are wonderful! it all comes down to one thing though: KAHANE IS SWEET, but don't forget: if you are lazy you are boned!!\t11/15/2007\t N/A\t N/A\t4.0\t4.5\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL368\tFabulous.  Puts so much effort into his classes, gives tons of feedback.  In return, expects students to really put out...with so much support, you can't help but get better, especially at writing.  Plus, he's just brilliant.  If only all profs could be like him!\t04/26/2007\t N/A\t N/A\t4.0\t4.0\t100008\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tDr.Kahane is one of the best professors I had in my first year. The class would be difficult if you did not do your reading. But if you do it, it can be a very interesting class and relatively easy. And lots of animated gifs make the class all the more awesome.\t04/23/2007\t N/A\t N/A\t2.0\t4.5\t100008\tawesome\tWrappedArray()\t Yes\t0\t1\t N/A\nnull\t N/A\tPHIL101\tAwesome teacher and the class is good. If you dont think you like phil you will after this class. Also dont be discouraged by your first essay you just have to learn to write phil papers. My first paper was a 2.3/4 by the end of the term i was writing a 4/4. Do the work and youll be fine\t01/15/2007\t N/A\t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tA genius of charisma!\t01/11/2007\t N/A\t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tLazy and you're boned? Untrue. I didn't even look at the assigned readings unless I was writing a paper on it. Very enthusiastic teacher, the class notes were VERY helpful and made concepts more clear than the actual readings (though he uses too much jargon and speaks quickly), so GO FOR THE NOTES. He really knows his stuff, great class.\t01/11/2007\t N/A\t N/A\t2.0\t3.0\t100008\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHILO101\tEasily the best prof I've had during my stay at the U. Consistently engaging and rewarding lectures. Attending class and keeping to date on your readings is a must. Essays can be hard, but don't be discouraged by a low mark, if you understand the material you can boost it come the final.\t01/04/2007\t N/A\t N/A\t4.0\t5.0\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tThis prof is super! He has a really good approach to teaching and plays funny clips and videos! This class is hard if you don't do the readings and go to Friday sections. Essays can be difficult depending on who your TA is. All in all this a good class but you cannot really miss classes or you \"will be boned.\"\t01/02/2007\t N/A\t N/A\t3.0\t4.5\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tExcellent teacher. He is fair, speaks very well and shows devotion and creativity.  Class is not hard IF you do the work.\t12/21/2006\t N/A\t N/A\t2.0\t5.0\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tSuch a fantastic professor. Very charismatic, he's pretty much the sh*t! Engages you with the material, is enthusiastic and makes you look forward to  lectures. Despite how fun, this course is no cakewalk though, 500 words is not much room to ramble or bs.\t12/14/2006\t N/A\t N/A\t3.0\t4.5\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL100\tAs a prof, he his exrtrodinary. His lectures are very well articulated and his notes are very helpful. However he is a hard marker. Weekly quizes worth 20%, usually only 2-4 hard MC questions. Essays are marked hard aswell, saving grace is participation. If you are thinking of taking this as an easy course to raise your GPA think again.\t12/12/2006\t N/A\t N/A\t5.0\t4.5\t100008\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tPHIL101\tDon't miss Friday sections. Attendance a must. I honestly thought philosophy meant any answer was right, and that you just had to argue it well. Technically this is true....but 500 word papers, and the 'no-fluff' rule makes this a nightmare!\t12/08/2006\t N/A\t N/A\t3.0\t4.5\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHIL101\tGreat prof. Teaches you how to write, and think. However, it is a class in which work is rewarded, and laziness is punished. The work is worth it.\t12/01/2006\t N/A\t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tPHI570\tProfessor Kahane is the best professor I have ever had. He's extremely articulate, intelligent and helpful. While he is a hard marker, he is fair to all and sundry. If you really want to possess knowledge, and are not lazy, then you have no choice but to take one of his classes.\t05/02/2006\t N/A\t N/A\t1.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tGreat lecturer - engaging and clear, and really cares about the students.  High standards, but offers you lots of support so if you take advantage of that your marks and writing skills will both benefit.  Highly recommend.\t01/11/2006\t N/A\t N/A\t3.0\t4.5\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tGreat class to learn how to develop effective argumentative papers. Quizzes on material every Monday. He likes to mix up words/meanings to try to confuse you. Lots of reading involved, but a great experience. Only 3 or 4 short 500 word papers, weekly quizzes, and a final. Overall, very interesting and engaging class. Kahane loves to teach.\t01/02/2006\t N/A\t N/A\t4.0\t3.5\t100008\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tHe's better at keeping me awake than any other professor. Very entertaining and likeable. But a word of caution: if you're used to BSing on quizzes and papers, you're in for a rude awakening because it will NOT fly. If you're lazy, you are boned.\t11/24/2005\t N/A\t N/A\t4.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t300PHILOSOPHY\tIf teachers were gods, he'd be them all. Take him as early in your schooling as possible, and it will pay dividens.\t03/30/2005\tN/A \t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tPHIL368\tReally hard requirements, but if you give the effort, it WILL be rewarded! Incredibly helpful, really cares about his students. Best professor I've ever had. Deliberately keep taking his courses.\t03/10/2005\tN/A \t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tLearned how to write in this course. And he's funny.\t12/09/2004\tN/A \t N/A\t3.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t270\tTotally cares about students. Lots of work, but worth it (especially for improving your writing).\t11/26/2004\tN/A \t N/A\t4.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tPHIL101\tTHis is my hardest class but also my favorite. Prof Kahane is funny, super organized and obviously interested in students doing well. The weekly assignements have improved my writing a lot.\t11/26/2004\tN/A \t N/A\t5.0\t5.0\t100008\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL270\tKahane's a hardcore, he knows his stuff. His arrogance is deserved. If you're majoring in humanities, especially philosophy, take his class just to improve your writing skills. He is very critical, and forces you to learn the lingo but if you plan to be a career academic, Kahane's class is a must\t11/04/2004\tN/A \t N/A\t4.0\t4.0\t100008\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tPedantic and creepy but a fairly good fit for a big first-year lecture.\t08/04/2003\tN/A \t N/A\t2.0\t3.5\t100008\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPHIL101\tGood teacher, just really arrogant\t12/15/2002\tN/A \t N/A\t3.0\t3.5\t100008\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFDSCI101\tgo to class, take notes & you'll do well. There are suggested online readings that are helpful for the midterm but not mandatory. Shows a lot of videos that aren't mentioned on the exam so you don't need to come to class those days. Only midterm & final determines grade so be careful. Clydesdale makes classes funny and enjoyable. take this class!!\t11/06/2007\t N/A\t N/A\t2.0\t5.0\t100010\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tFOODSCI101\tHe is an awesome professor! He actually helped designed the food pyramid so you know he knows what he's talking about. Great at explaining things and making class entertaining. Smart, funny guy.\t04/09/2006\t N/A\t N/A\t2.0\t5.0\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODSCI101\tAwesome guy... easy class... Just one little packet to read... and go to lectures they're funny... he loves telling stories about people getting explosive and uncontrollable.. umm flatulence.\t01/24/2006\t N/A\t N/A\t2.0\t4.0\t100010\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODSCI101\tDo you wanna laugh?  Take his class.  It was the best class i've had so far, b/c not only did i laugh, but i learned too.  A very important combination.\t12/16/2005\t N/A\t N/A\t2.0\t5.0\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODSCI101\tbest class and teacher ever.  don't front this guy rules\t09/14/2005\t N/A\t N/A\t1.0\t5.0\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODSCI101\tI love Fergus, he is my favorite teacher yet.  Has so many funny stories to tell you will actually want to go to class to hear them.  Really interesting stuff too.\t12/21/2004\t N/A\t N/A\t2.0\t5.0\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODS101\tbest teacher I've had so far...so adorable and really funny.  Just a genuinely nice, jolly guy. You don't have to read at all for the class..just go to the lectures and it's all good.\t11/03/2004\t N/A\t N/A\t1.0\t5.0\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFOODSCI\tThe guy really tries to make the course fun. He is really helpful.\t10/11/2004\t N/A\t N/A\t3.0\t4.0\t100010\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFDSCI101\tHmmm what to say? Really funny guy. Teaches really boring material but tries to make it interesting. Switched half way thru the semester with some guy who SUCKED. Sometimes Fergus can drone on and on about stuff you'll never remmeber but hes a good gu\t07/14/2003\t N/A\t N/A\t3.0\t4.5\t100010\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tARTPAIN\tMichael was a great teacher.\t04/21/2010\t N/A\t N/A\t3.0\t4.5\t100011\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tPAINTIII\tGreat instructor. Michael is very helpful and takes the time to make sure everyone's on the same page. HOWEVER... He's not dependable. Never ask him for anything, especially letters of recommendation... he nearly cost me my acceptance to graduate schools! HE TOOK OVER THREE MONTHS... and even then, was late by 2 weeks!! Never again.\t12/10/2008\t N/A\t N/A\t3.0\t5.0\t100011\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\t220\tMichael is the MAN - GET IN HIS CLASS\t11/04/2005\t N/A\t N/A\t1.0\t5.0\t100011\tawesome\tWrappedArray()\t N/A\t0\t1\t N/A\nnull\t N/A\tSUMMERSTUDIO\tSmart, clear, helpful, and constructive. I look forward to another class with him this upcoming semester.\t08/31/2005\t N/A\t N/A\t2.0\t5.0\t100011\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tFOUNDATION\tfoundations and painting 101. i love this man! best teacher ever.\t04/14/2003\t N/A\t N/A\t1.0\t5.0\t100011\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMMBFINI\tVery helpful, very kind, very fair.  Writes alot of good notes on the board.  explains everything clearly.  always glad to help at office hours with anything.  HW is not that much, but can be difficult. takes attendance 5-8  times per semester. drops the lowest midterm grade.  STUDY, ask lots of questions, go to office hours, and u'll get A-/A.\t06/14/2009\t N/A\t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU3002\tTwo thumbs up.\t07/01/2008\t N/A\t N/A\t3.0\t4.5\t100013\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU3002\tHad her for Diff Eq. She was amazing. Shes an awesome teacher and I actually am taking a math class next year specifically because she's teaching it. Attendance isnt mandatory, she curves tests, and she's usually chill about accepting weekly homework late...\t04/03/2008\t N/A\t N/A\t4.0\t4.5\t100013\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU1109\tshes cool her class can get boring but she doesnt want you to fail... your going to have to study in this class.\t11/19/2007\t N/A\t N/A\t3.0\t3.0\t100013\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tMTRU1109\tGood teacher. Sometimes hard to follow, but will go over everything in her office hours.  3 tests, but she drops 1.  Homework problems are a little much, but you get used to them.  I'd take her again\t04/11/2007\t N/A\t N/A\t2.0\t4.5\t100013\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU1109\tDon't listen to the bad reviews. She's not the easiest prof at Fordham but she knows how to teach. She writes/speaks VERY fast but, her notes prepares you for the exams. The lowest exam grade (excluding final) is dropped. You'll get a great grade if you do the hw & study. take her!!!!\t03/28/2007\t N/A\t N/A\t3.0\t3.5\t100013\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMATHII\tMs. Girardi is a great teacher, take her if you can. Unlike many teachers, she genuinely wants you to do good in her class. I did very little work and I ended up with a B, so if you're looking for a pretty easy grade then take her class.\t01/19/2007\t N/A\t N/A\t1.0\t4.0\t100013\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU1010\tterrible teacher, but she does let you redo your homeworks to get credit back, and corrections on the midterm which is something that no teacher ever does, so she tries to see you do well, but the fact that it has to come to that bc she doesnt know how to teach is bad. you will hate this class with a passion if you take it, and she plays favorites\t01/10/2007\t N/A\t N/A\t3.0\t1.0\t100013\tawful\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tMTRU005\tShe gives a lot of homework and the homework is taken very seriously because it is seriously graded by her grader.  Her tests very comprehensive and long thus you need to study and take copious notes in her class.  No midterm, but there are 3 tests and 1 final.  She has no personality; can be sardonic and indifferent sometimes.\t01/04/2007\t N/A\t N/A\t2.0\t2.5\t100013\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMETHBUS1\tMath Methods Business I: very good teacher. She goes at the rate the class needs, but wont stay too l ong on difficult material, you need to go in for extra help. she's very very nice, funny at times, and her tests aren't too bad. Usually they are curved a lot, which is great, but if you need help ask in class before it becomes too confusing\t12/27/2006\t N/A\t N/A\t2.0\t4.0\t100013\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMATH1100\tI loved her.\t11/30/2006\t N/A\t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMTRU1010\tGood teacher, has a sense of humor, not the best explainer of concepts but okay.\t10/26/2006\t N/A\t N/A\t3.0\t3.0\t100013\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tMATHMETH2\tVery nice professor who knows what she's talking about. 3 midterms, but she drops the lowest one. Homeworks dont count against you unless you never do them. The final is 40% of your grade so be prepared.\t05/21/2006\t N/A\t N/A\t2.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATHMETHODS2\tExcellent profesor. Recommended if you have a background in math.\t05/02/2006\t N/A\t N/A\t2.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATHINGENERAL\tDr. Girardi is one of the best professors at Fordham.  She may give tricky tests but she's a fair grader and is just trying to see if someone gets it.  Wonderful personality, so sweet!\t02/26/2006\t N/A\t N/A\t2.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tDISCRETEMATH\tOnly take this class if you are a Math major and even then be ready for something different. She expects entirely too much from her students. Unclear explanations that are just taken right out of the book. Expect a huge workload and some biased towards non-math majors. Doesn't bring anything new to clear up anything. OTOH, always ready to help.\t01/17/2006\t N/A\t N/A\t5.0\t2.5\t100013\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALCULUS\tnot that great of a professor,, she makes a lot of mistakes while teaching which does not help when u r not good in math to begin with,, she changes things she said, for example,, she will say whats the exam gonna be like and it wont be how she said it,,and too much homework\t12/16/2005\t N/A\t N/A\t4.0\t2.0\t100013\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tFINITEMATH\tIM TERRIBLE AT MATH TO BEGIN WITH, BUT GIRARDI MAKES EVERY EFFORT TO SEE HER STUDENTS DOING WELL. TAKES INTEREST IN THOSE WHO WANT TO DO WELL AND SHOW IT BY ASKING QUESTIONS. DEF A GREAT PERSON TO DEAL WITH AND TALK TO ONE ON ONE.. IF YOU HAVE TO TAKE A MATH.. TAKE HER\t12/02/2005\t N/A\t A\t4.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tINFINITEMATH\tThis teacher really knows her stuff and even though the class is tough, it is the best math class I've ever taken.  Highly recommend the prof since she cares about students who go to her for help.\t11/22/2005\t N/A\t N/A\t1.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINITEMATH\tfirst of all class seems easy but it is very difficult! she thinks you already know everything and she gives out a lot of homework!! class average on the first test umm let me think a 64 second test 65!! who ever thinks this teacher is hot better get their eyes checked!! dont take her\t11/17/2005\t N/A\t N/A\t4.0\t2.0\t100013\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALCII\tWhat a sweetheart. Really cares about her students and their performance. She is young and makes math as fun as it can possibly be.\t11/09/2005\tN/A \t N/A\t3.0\t4.5\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tFINITEMATHEMAT\tNo Comments\t10/07/2005\tN/A \t N/A\t3.0\t1.5\t100013\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATH1\ttoo much work, thinks u know everything, i did worse than i thought, unclear grader!\t09/13/2005\tN/A \t N/A\t4.0\t1.0\t100013\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALI\tI love this woman. Had her a few years ago.. forgot to rate her..if ur gonna take cal, n she's teachin, take her.\t08/30/2005\tN/A \t N/A\t3.0\t4.5\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMETHODS2\tShe's a nice lady but give you a ****load of work in class and for homework. Throughout the semester I used 2 whole notebooks, that's how much notes she gives...she just never stops. But overall the best math professor I've ever had, only she could use a fashion makeover, coz her sneakers have holes in 'em!\t05/18/2005\tN/A \t N/A\t3.0\t2.0\t100013\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALCII\tExtremely nice and very helpful. Her homework is good preparation for her tests and her tests are very clear, though understandably challenging b/c of the subject. She makes the class interesting and def worth your time! Take her if you can!\t05/14/2004\tN/A \t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMETHODS2\tvery good prof, very straighforward, gives good notes, tests based on hw. she;s nice and all but somebody should give her a fashion makeover!!!!\t03/31/2004\tN/A \t N/A\t3.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATHMETHOD\tShe's a nice lady but if you dont have an inclination for math dont take her. However she's a moderately easy grader\t03/05/2004\tN/A \t N/A\t4.0\t3.0\t100013\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALCULUSI\tVery nice lady; willing to help you with anything; tests are pretty straight foward and arent really hard; notes given in class are ok; overall pretty easy and painless class, especially for Calculus; take her you wont regret it\t12/16/2003\tN/A \t N/A\t2.0\t4.5\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALC1\tProf. Girardi is very helpful and one of the friendliest teachers I've ever had. While by its very nature Calc 1 is a horrible class for many people, Prof. Girardi alleviates the pain. She is the best Math teacher at Fordham.\t12/07/2003\tN/A \t N/A\t4.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATHBUS2\tVery good teacher. She gives a decent amount of hw, but not an overbearing amount. Easy grader. Her tests are straight forward she tells you exactly what is on them.\t12/05/2003\tN/A \t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALCULUS1\tthe class is a bit intimidating at first, and the grading system is pretty hard (90% of grade is based on 3 tests) but she's pretty clear and will go over things you just have to ask or she will assume you're as smart as her. take for a challenge!\t12/05/2003\tN/A \t N/A\t3.0\t3.5\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATHMETH1\tI'm not a math person, but I found her class very straightforward. Homework helped reinforce what she taught and prepares you for exams. Best math teacher that I've come across\t12/05/2003\tN/A \t N/A\t4.0\t4.5\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tBUSMATH\tbest teacher ever! willing to help u out and understands that people makes mistakes. gives curves, and will take time out to see you anytime. show some effort and she'll grade extremely fair. Take her classes if you can, I did twice and got 2 A-'s\t11/30/2003\tN/A \t N/A\t1.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATH1\tHEY, AT LEAST SHE SPEAKS ENGLISH!!!!\t11/25/2003\tN/A \t N/A\t3.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALC\tVERY NICE WOMAN, SOMETIMES GETS A LITTLE CONFUSED. DOESN'T GIVE OUT ENOUGH TESTS, SO IF YOU DO BAD ON ONE TEST, YOU'RE SCREWED.\t11/25/2003\tN/A \t N/A\t3.0\t4.0\t100013\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATH\tBest Math Prof at Fordham... which is not saying much\t11/21/2003\tN/A \t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCALC\tsuch a nice lady; very helpful; tests are not too hard; will pass anyone who shows effort; very good at explaining and will take time to answer questions and make sure you understand the work\t04/10/2003\tN/A \t N/A\t2.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMATH\tif u show a little effort you cant fail\t03/30/2003\tN/A \t N/A\t1.0\t4.5\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMTRU1108\tNo Comments\t03/05/2003\tN/A \t N/A\t3.0\t5.0\t100013\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Not Mandatory\tCHI450\tI took several classes with this professor. I really struggled in this class , but learned a lot about Chinese grammar and research as well a independent research.  This professor gave me  the skills to operate at the highest levels of government working in the language.\t07/30/2017\t Yes\t B\t5.0\t5.0\t100014\tawesome\tWrappedArray(RESPECTED, GIVES GOOD FEEDBACK, LOTS OF HOMEWORK)\t No\t0\t0\t Yes\nnull\t N/A\tCHI450\textremely detailed, and critical. Some of my best \"AHA\" moments, intellectually speaking, were in his class.\t04/16/2010\t N/A\t N/A\t5.0\t4.0\t100014\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHIN111\tHad this professor eons ago. Learned a tremendous amount - but I will say that his idiosyncrasies ..and his obsession with ghost tales did amuse us.\t04/14/2009\t N/A\t N/A\t3.0\t2.5\t100014\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHINESE104\tProbably one of the most boring clases I have ever taken. The professor is extremely monotone. You dont have to read the book or go to class, just do really well on the papers and your fine. There are no tests and papers are pretty short. If you can avoid the class though, I woulld reccomend it.\t12/21/2005\t N/A\t N/A\t3.0\t3.0\t100014\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHI138\tthis class was extremely hard and the papers were graded ridiculous. there are only papers in the class but they were graded so critically it was hard to have any success.\t12/13/2005\t N/A\t N/A\t5.0\t1.0\t100014\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHINES138\tthe class consisted of papers~pretty easy~ his lectures can EASILY be used for the papers and the papers were short 2-3 pages. dont do the readings... books not always needed.  lectures seemed boring to me\t11/17/2005\t N/A\t N/A\t2.0\t4.0\t100014\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tCHINESE138\tYou do not have to show up to class every day to get a good grade in Chinese 138, but I was so interested that I went to class every day anyway. If you go to his office hours, he will offer you a wide variety of Chinese tea! He is the nicest professor that I've ever had.\t03/06/2005\t N/A\t C\t1.0\t5.0\t100014\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHINESE138\tThis class is a F'N joke.  NO TESTS. NO ATTENDANCE REQUIRED.  Don't buy books.  Do the papers on time.  I didn't do a paper, and got a B!\t01/03/2005\t N/A\t N/A\t3.0\t4.0\t100014\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t450H\tCohen is a dedicated hard working professor. He's willing to discuss anything you may have questions about. His massive intellect may be intimidating at times, but fear not, he uses it all to help you.\t11/17/2004\t N/A\t N/A\t5.0\t5.0\t100014\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t138\tvery intelligent...dedicated\t10/25/2003\t N/A\t N/A\t2.0\t3.5\t100014\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHN570\tHe is the best teacher I have ever had in my life.  His dedication and knowledge combine with his warm personality to make him my favorite teacher and mentor.\t05/02/2003\t N/A\t N/A\t4.0\t5.0\t100014\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHIN888\tOne of the most dedicated and hardworking teachers I have ever encountered. Always available to students. Great sense of humor.  Brilliant.  Creative.  Insightful. If you don't enjoy his class, there might be something wrong with YOU.\t04/21/2003\t N/A\t N/A\t4.0\t5.0\t100014\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tCHE211\tThe greatest professor to ever grace the campus of Gannon. Sadly he retired in 2015 but truthfully just one of the greatest people you will ever meet. A person who enters your life and wants you to succeed. I look back on my time with Dr. Pelczar and just thank him for the impact he had on my life. Hats off to you Dr. Pelczar.\t05/01/2018\t Yes\t A+\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t No\t0\t0\t Yes\nnull\t N/A\tOCHEMIII\tProbably the best teacher I have ever had in my life so far. I was terrified going to O Chem 1 but Dr. Pelczar is the man! Sadly, he is finally retiring but it was a blessing to have him as a professor! His catch phrases, jokes and comments are legendary and everybody who every had him remembers them. Also, the nicest guy I've ever met.\t03/27/2015\t Yes\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray(SKIP CLASS? YOU WON'T PASS., RESPECTED, AMAZING LECTURES)\t Yes\t0\t0\t N/A\nnull\t N/A\tCHEM224\tAwesome teacher makes ochem easy!\t11/07/2013\t N/A\t N/A\t2.0\t5.0\t100015\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tOCHEM1\tHe's just awesome.  Literally awesome.  He will get you to learn the material in the best way.  Knows what he's doing from experience.  He is also extremely nice.  Probably one of the best professors I've had here at Gannon.  He gives daily quizzes, but they are worth like 1.5 pts and mainly help you to make the exam easier. Def recommend to all.\t10/28/2013\t N/A\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHEM221\tA great great man and professor. I found his lectures to be very interesting. His chemistry jokes are a legend too. The easiness of the course is up to you. Follow his advice and study everyday, you'll succeed. Don't and you will struggle.\t06/04/2013\t N/A\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tOCHEM1\tLovely professor that has a heart. He's always very prepared and knows how to teach in a way that can reach diverse audiences. Definitely one of the best professors Gannon has ever had. Study every day, recopy notes, start the hw early, and you will succeed.\t12/19/2012\t N/A\t N/A\t4.0\t4.0\t100015\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tOCHEM\tThe Best Professor at Gannon. \"YA DONE\".\t05/01/2012\t N/A\t N/A\t2.0\t5.0\t100015\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHEM1\tAbsolutely superb teacher. It's been over 35 years since I took his class and he remains #1 in my book as my most outstanding instructor.\t05/15/2011\t N/A\t N/A\t2.0\t5.0\t100015\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHEM224\tFrank Pelczar is the man, if not a demi-god. He is VERY wise about organic. Took him for Organic I,II,III. Organic I is a pain due to daily quizzes,II b/c of the amount of info,III b/c its at 8am. Quizzes/tests are easy,right from notes and dont change throughout the courses, but if you cant do synthesis or memorize reactions your screwed.\t09/30/2010\t N/A\t N/A\t2.0\t4.5\t100015\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tOCHEM12\tVery good teacher. He is probably the best teacher in the chem department and is very friendly and kind. Also he is entertaining in class. Ochem 1 may seem easy, but ochem 2 will be hard. STUDY and keep up with Notecards!\t02/19/2010\t N/A\t N/A\t3.0\t4.5\t100015\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHEM250\thave had this professor for three semesters in a row (o-chem) and would highly recommend taking him\t10/23/2009\t N/A\t N/A\t1.0\t4.5\t100015\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHE211\tOne of the best persons you'll ever meet.\t08/26/2009\t N/A\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHEM221\tThe quizzes every single class are a pain! It makes you study every single day leaving no time for other classes so beware!\t11/11/2008\t N/A\t N/A\t4.0\t3.5\t100015\tgood\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHEM221\tOrganic chem 1- Study before every class or you'll get behind and have to cram for the tests (very hard to do!!)\t11/07/2008\t N/A\t N/A\t4.0\t2.5\t100015\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHEM222\tFor O Chem 1, it's EASY as PIE. However, O Chem 2 has the ablity to tear you a new one.  So remember you have to work MUCH harder for an A in O Chem 2.  Heed my advice!\t04/28/2008\t N/A\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tOCHEMIII\tPelczar is the man. Period. He tells you exactly what you have to know for exams and gives you handouts of the notes everyday in class. The quizzes for O chem 1 everyday are sometimes a pain but really help in the end. Plus he is an excellent teacher and knows his stuff.\t01/17/2006\t N/A\t N/A\t2.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANICCHEM\tGreat teacher!\t01/07/2006\t N/A\t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tOCHEM13LAB\tProbably the most efficient prof you'll ever see in any class.  His notes are outdated based on the current literature and the Morrison & Boyd book is clearly NOT a good one.  He's still the man though.  An absolute wizard\t10/11/2005\t N/A\t N/A\t1.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANICIIII\tNoty sure if he's still teaching, but he knew his stuff.  I never saw him use notes in any classes I took from him.\t09/06/2005\t N/A\t N/A\t3.0\t4.0\t100015\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANIC\tHe is a nice man who knows his stuff.  His tests are a piece of cake if you know your notes.\t03/08/2005\t N/A\t N/A\t3.0\t4.5\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tOCHEM12\tI *HEART* DR. PELCZAR!\t01/23/2005\tN/A \t N/A\t2.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tOCHEM1\tHe's a great guy, gives you a copy of his notes, and explains everything very clearly. The daily quizes are a pain but are very helpful come exam time which are, if you study everyday very well, a piece of cake.\t12/12/2004\tN/A \t N/A\t1.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tOCHEMI\tGreat man, very intellegent. he provides notes on all material. gives quiz everyday on previous day's material (not hard). helps u out if u miss a class, wouldn't recommend it though. best way to understand material, recopy notes. book virtually useless for test. GREAT MAN!\t11/14/2004\tN/A \t N/A\t4.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tOCHEM\tvery intelligent. he's like a machine when he's lecturing. very clear. subject is just boring and difficult.\t09/03/2004\tN/A \t N/A\t4.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANIC1\tMoves fast, but very knowledgable and fair with his tests and homework.\t12/13/2003\tN/A \t N/A\t4.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANIC\tvery bright man and one of the best teachers at gannon\t03/16/2003\tN/A \t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tORGANIC1\tWonderful man. Fun class. Keep up with notes, he's a fast one!\t12/16/2002\tN/A \t N/A\t3.0\t5.0\t100015\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tHT432\tN. American and Carribean lit was the first class I had to read an entire novel in Spanish. He made the experience much less painful but it was still a difficult class.\t05/07/2018\t Yes\t Not sure yet\t4.0\t5.0\t100017\tawesome\tWrappedArray(EXTRA CREDIT, GIVES GOOD FEEDBACK, GET READY TO READ)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tSPAN231\tI haven't had a lot of luck with Spanish teachers throughout the years. But everything changed when I took Mark's class. He is so funny and he makes you want to show up for class. Weekly vocab quizzes but they aren't difficult if you study. We watched clips in Spanish on Friday's. He's an amazing teacher, if you're taking Spanish 231 you want Mark.\t03/20/2018\t No\t N/A\t2.0\t5.0\t100017\tawesome\tWrappedArray(GIVES GOOD FEEDBACK, CARING, HILARIOUS)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tSPAN231232\tI really loved taking SPAN 240 with Mark! He is absolutely hilarious with his dad jokes and funny stories. In my opinion, Mark teaches the material extremely well and is really passionate about Spanish. I would 10/10 recommend taking classes with Mark over anyone else except Lori. Movie Fridays is a legit recognized holiday in his class. 10/10\t11/16/2017\t Yes\t A+\t3.0\t5.0\t100017\tawesome\tWrappedArray(HILARIOUS, SKIP CLASS? YOU WON'T PASS., CARING)\t No\t0\t0\t Yes\nnull\t Mandatory\tSPAN302\tHe is really funny. He tells corny jokes all the time. Work is easy, just study vocab and read and you will be fine.\t04/13/2017\t Yes\t Not sure yet\t3.0\t4.0\t100017\tgood\tWrappedArray(HILARIOUS)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tSPAN301\tI had taken two classes with Couture and will be taken another one. His classes are fun and he loves to joke around. There is not a lot of work to do outside the class and he does give you extra credit for attending Tertulias. Couture makes sure that everyone understands the topic and that no matter what everyone is having fun.\t10/06/2016\t Yes\t A\t2.0\t5.0\t100017\tawesome\tWrappedArray(RESPECTED, HILARIOUS, EXTRA CREDIT)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tSPAN101\tThis class was better than I anticipated. Mr. Couture is a wonderful professor on various levels. He makes sure everyone understands the material. His personality makes the course fun. There are a normal amount of tests, but they are super easy if you simply pay attention in class. I would take his class again.\t08/15/2015\t Yes\t A+\t1.0\t4.5\t100017\tawesome\tWrappedArray(GIVES GOOD FEEDBACK, PARTICIPATION MATTERS)\t Yes\t0\t0\t Yes\nnull\t N/A\tSPANISH101\tSuper nice and helpful. Little tough if you've never taken Spanish before. Speaks Spanish a lot so it can get confusing, but does go over all the information that's going to be on the test the day before. Loves puns, he's really funny!\t04/07/2015\t Yes\t N/A\t2.0\t3.5\t100017\tgood\tWrappedArray(SKIP CLASS? YOU WON'T PASS., HILARIOUS)\t Yes\t0\t2\t Yes\nnull\t Mandatory\tSPAN231232\tAn amazing professor who has definitely helped me learn spanish in a different way than ever before. I would take him every chance I could and suggest anyone who has to take spanish take him because he is easy yet helps you learn. I've thoroughly enjoyed the year of classes I've had with him.\t12/10/2014\t Yes\t A\t2.0\t4.5\t100017\tawesome\tWrappedArray(RESPECTED, CLEAR GRADING CRITERIA)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tSPAN231\tA fantastic Spanish teacher; he really knows his stuff. Going to take Spanish at WCU? You want him!\t12/02/2014\t N/A\t A\t4.0\t4.0\t100017\tgood\tWrappedArray(SKIP CLASS? YOU WON'T PASS., PARTICIPATION MATTERS)\t Yes\t0\t0\t N/A\nnull\t Mandatory\tSPAN231\tAwesome Professor! Very helpful and not much work assigned for out of class. Tests can be a bit tricky but if you attend the review session he pretty much gives you the test\t11/10/2014\t Yes\t A\t2.0\t4.5\t100017\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPAN231\tPretty great teacher so he makes it pretty easy to learn spanish if you are interested. I ended up making it my minor. but you have to buy quia online and bring your book to class everyday and deal with his jokes. He always gives you a study guide for the test.\t04/04/2013\t N/A\t N/A\t2.0\t4.0\t100017\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPAN102\tEasy course. Have to buy an online Quia account. DONT FORGET ONLINE WORK! Mark is very corny and likes to joke around. Loved this course!\t12/15/2012\t N/A\t N/A\t1.0\t5.0\t100017\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPAN102\tHe is a great spanish teacher. He doesn't assign much work and make the class interesting by telling horrible jokes. He also grades the test somewhat easy. Its a good class\t12/06/2009\t N/A\t N/A\t2.0\t3.0\t100017\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPAN102\tNot too bad! Pretty easy class with study guides for the tests. Very laid-back, comfortable, funny professor. Also, very knowledgable, patient, and willing to help you learn. However, you have to be self-discliplined to actually learn the Spanish. Overall, good class!\t11/11/2008\t N/A\t N/A\t4.0\t3.5\t100017\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPANMISC\tI took two classes with Dr. Couture (I was a Spanish minor), and loved both classes.  He has a great understanding of the Spanish language and culture, and he teaches very well.  Very patient and fair.  His classes are easy if you do the work.  He's not too bad on the eyes either!  Take a class with him if you can!\t04/22/2008\t N/A\t N/A\t2.0\t5.0\t100017\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tSPAN102\tThe class was easy. It was a good refresher course for my three years in highschool.  Dr. Couture is pretty easy going and his exams are not hard at all if you study.\t11/17/2007\t N/A\t N/A\t2.0\t4.0\t100017\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMANYSECT\tidk y but he's sooo cute in his own way even if he is like 40 or more.lol. classes are easy. helps as much as possible. funny. like a normal collee student more so than a teacher....he is smart and knows alot aboutthe world, not just whats he's teaching...really cool.\t08/16/2007\t N/A\t N/A\t2.0\t2.0\t100017\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHISPLIT\tIt is near impossible not to adore this man, starting on the first day of class where he tells the worst jokes EVER. Seriously ever. But its SO cute (he hates the word cute btw) He is extremely laid back, understandable, gives very little work. If you dont go to his class you wont really fail but trust me, you'll want to. This was my fav. class.\t07/27/2007\t N/A\t N/A\t1.0\t4.5\t100017\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tANTH120\tHis lectures are like watching a funny play. He will like you if you sit up front and talk to him, all of his perspectives are very interesting and he will make you understand anything you dont. INformation is the kind that is actually usefull later on. He is an AWESOME funny way cool prof. Take his class\t07/27/2007\t N/A\t N/A\t2.0\t4.5\t100017\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSPAN190\tTHE easiest you'll have. All grades basically based on that you merely complete the work. You'll watch movies and write OPINION papers.\t10/15/2006\t N/A\t N/A\t1.0\t5.0\t100017\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tSPAN102\tGreat professor~very helpful and understanding\t03/16/2006\tN/A \t N/A\t2.0\t5.0\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPANISH\teasy. nice, helpful. easy quizes. fun class. and he tells the lamest jokes.\t02/03/2006\tN/A \t N/A\t2.0\t5.0\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN\teasy, nice, helpful\t12/11/2005\tN/A \t N/A\t1.0\t4.0\t100017\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN102\tGreat professor!!!!\t11/05/2005\tN/A \t N/A\t2.0\t5.0\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN102\tHe may be a good teacher, but I lost all respect for him as department head when he agreed to do a substitution for a requirement for my major, and then five months later when classes started he told me he'd changed his mind and wouldn't allow me to.I had to change all my classes just to graduate.\t04/18/2005\tN/A \t N/A\t1.0\t3.0\t100017\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN330\tLaid back style is good. More predictable might help.\t04/05/2005\tN/A \t N/A\t3.0\t4.0\t100017\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN\tThe coolest Spanish teacher at Western. Great teacher as well.\t08/26/2004\tN/A \t N/A\t3.0\t5.0\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN190\tNo Comments\t11/11/2003\tN/A \t N/A\t1.0\t4.0\t100017\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tALLSPANIS\the is awesome! if you have to take any spanish class take it with him. You learn the most and he is the most energetic...wonderful teacher!\t06/17/2003\tN/A \t N/A\t2.0\t4.5\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tADVISOR\tNo Comments\t04/23/2003\tN/A \t N/A\t3.0\t1.0\t100017\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN248\tDa Bomb\t02/19/2003\tN/A \t N/A\t3.0\t5.0\t100017\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tSPAN301\tNo Comments\t12/15/2002\tN/A \t N/A\t2.0\t3.0\t100017\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tSifuentes remains as one of the most influential figures in my life. His immense literary knowledge, guidance, and sense of humor have positively shaped his students to be great individuals. May he rest in peace. Profe, gracias por todo. ~Rodolfo S Vasquez\t07/26/2011\t N/A\t N/A\t3.0\t4.5\t100020\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\tHe was a really good professor! Really nice and funny, he can be  sometimes late! But he didnt give alot of HW & Final was really easy! yes do you do have to read the book because he may just call on you to ask you what the reading  was about!\t11/20/2008\t N/A\t N/A\t1.0\t3.5\t100020\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\the is the worse teacher ever...his lectures never made any sence....he would forget about what he was talking about most of the time....parts of the test were about things he didnt discuss or that werent even in the books....he is useless\t11/19/2008\t N/A\t N/A\t4.0\t2.0\t100020\tpoor\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHS100\tTHis professor is ok. He is funny sometimes, but he is boring. No one ever talks in class unless he puts you on the spot( reading questions from the book) Almost never did no homework, mostly read. If he likes you he will give you an A.\t07/01/2008\t N/A\t N/A\t2.0\t2.0\t100020\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS201\tRoberto Sifuentes is an amazing man and a great professor. His tests are pretty difficult but if you come to class regularly it shouldn't be so bad. Also, keep up with the readings and your tests and papers should be a synche!\t12/04/2007\t N/A\t N/A\t5.0\t4.0\t100020\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\the is the most boring teacher ever i have a hard time staying awake in his class. he lectures all the time and i don't understand half of what he's saying because of his spanglish and he doesn't really finish his sentences. His tests were on things based on stories he lectured about or on things we hadn't discussed, i really don't recommend him\t10/06/2007\t N/A\t N/A\t3.0\t1.5\t100020\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\the's a great guy, but a horrible teacher. he doesn't have an agenda of what he's going to teach. he tests you on a bunch of terms and definitions you never discussed in class, and he doesnt care. he talks a lot about women and just stories in general but the class is useless.\t09/30/2007\t N/A\t N/A\t2.0\t1.0\t100020\tawful\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS201\tI don't know anything about this teacher because I dropped the class after the first lecture because he gave a 16 page assignment on the first day of class and only a week to do it!\t08/28/2007\t N/A\t N/A\t5.0\t2.5\t100020\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHIC100\thes is a good professor has an accent in english as he is mexican....buy the readings and book will help you...take him if u want an A...or a class u can have as elective will relieve some stress in a way....\t08/24/2007\t N/A\t N/A\t1.0\t3.0\t100020\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100CHS201\tHe is very funny. teaches well but sometimes is hard to make sence of what he says. highly recommend him, just go to class, participate, and do your reading and you will do fine. midterm and final are similar.\t06/05/2007\t N/A\t N/A\t2.0\t3.0\t100020\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHS100\tif u want an easy A take this prof. I had tried to do something a little different and take ChS but after the first 2wks i realized that the class was a joke, so i stopped going. u cant understand him, bc his accent is horrible. its almost like hes **** we he comes to class. oh yea...and he loves to whistle.\t06/04/2007\t N/A\t N/A\t1.0\t1.0\t100020\tawful\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tCHS210\treally col teacher, he knows what hes talking about.\t05/23/2007\t N/A\t N/A\t3.0\t2.0\t100020\tpoor\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\tVery interesting Prof. He is funny! I enjoyed his class!! It was not stressing at all! Just do readings and you will be set.  Midterm and Final are very similar\t02/06/2007\t N/A\t N/A\t2.0\t3.0\t100020\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS300\tsifuentes is a very nice man!! he is very understanding and sweet! he picks on people to answer qs on the books!so be prepared..overall its an EZ class just as long as u do all the work required!\t02/01/2007\t N/A\t N/A\t1.0\t5.0\t100020\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS201\tSifuentes is very intelligent, kind, and funny. He is known for calling on students at random and kicking out those who don't read the required material, but that is just his way of knowing if you are keeping up in his class or not. He addresses all his students as \"companeros\" so it shows that he holds every student with the upmost respect. ^_^\t12/25/2006\t N/A\t N/A\t3.0\t4.0\t100020\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\tboring but easy, midterm the same as final. you need to go to class he takes role everyday. buy the reader and the book you will use it. he is very old so if you don't speak spanish or like profesors with accent then i don't recomend him.\t12/20/2006\t N/A\t N/A\t3.0\t3.5\t100020\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS201\the is not nice and if u are not prepared to answer questions 4m the readings he will kick u out of his class. he could be funny at times but i didnt like him. he was hard and u are required to write a 5pg essay on each of the 6 books you read, u have a midterm and a final that are hard. i failed both the midterm and the final but still got an A\t12/18/2006\t N/A\t N/A\t4.0\t2.5\t100020\taverage\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS100\tHE IS A WONDERFUL TEACHER. IF YOU'RE REALLY INTERESTED IN CHICANO STUDIES. HE IS VERY HELPFUL AND HE WON'T LET YOU FAIL HIS CLASS HE'LL GIVE EXTRA CREDIT AND IS WILLING TO SPEND TIME AFTER CLASS TO HELP, EXCELLENT TEACHER.. THE MIDTERM WAS THE SAME AS THE FINAL!!!\t12/17/2006\t N/A\t N/A\t1.0\t5.0\t100020\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tCHS201\tIt was kinda hard to keep up with the readings..but the books were very interesting. If you do not come prepared to class, he will kick you out and you will feel DUMB..Overal good teacher and pretty funny..Oh and companeros is nothing bad so dont trip.\t02/08/2006\t N/A\t N/A\t3.0\t4.0\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHICANOSTUDIES\tTook many years ago and I still get angry at the mention of his name.  Got an A but it was all about kissing but and knowing the right people.  If you are part of the \"chicano club\" scene you are in, if not he's sure to make an example of you.  He's nothing but a teacher who has favorites and tries to prove his power daily by humiliating people.\t02/06/2006\t N/A\t N/A\t3.0\t1.0\t100020\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCS100\tIf you do not speak FLUENT spainsh, not understand and can hold a convo, FLUENT! The first day of class he started speaking spainsh. BE PREPARED...its high school strikes back, in spainsh. Its a class that you dont want to take, but have to, to graduate. Look up the word &quot;companoira&quot; because he calls all his students that!!I think its an insult\t02/02/2006\tN/A \t N/A\t4.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHICANOSTUDIES\tthe worst of all time!!! I promise you won't be able to understand one thing that comes out of his mouth. He is very disorganized and his accent is the worst kind when it comes to teaching. This is not a joke....avoid him at all costs!!!!\t02/02/2006\tN/A \t N/A\t5.0\t1.0\t100020\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t351\tHe is a very knowledgeable teacher, he encourages his student to think outside the box, if you really want to learn, take his class. His test could be a bit challenging, but it's all worth it.\t01/29/2006\tN/A \t N/A\t2.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tCome to class prepared!! Otherwise, he'll send you to the library. He's great to take for literature, because he points out symbolism in the novels and will inspire you to use your imagination and become a character of the novel you're reading. Don't be afraid of the essays. He just wants to see you've been thinking. Most did very well on them.\t12/28/2005\tN/A \t N/A\t2.0\t4.0\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCH201\tI liked this teacher. If u dont read the books then ur going to be completly lost. Just do the work, turn in it time and be prepared. He shows great films in order for the students to understand his lectures better. He is hard if u are lazy and dont do the work\t12/14/2005\tN/A \t N/A\t2.0\t4.0\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS304\tAt first I was a bit skeptical. He had a strong mexican accent and gave alot of work. At the end I found out more about my heritage and the history behind it. He is a nice guy. Make sure to read the book and don't be lazy. Sometimes he can get boring but like I said before, in the end you come to realize that he did certain things for a reason.\t11/16/2005\tN/A \t N/A\t2.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tVARIOUS\tThis guy partied with Carlos Castaneda. It should be a privledge for you all to talk to him, much less take a class with him.\t10/22/2005\tN/A \t N/A\t3.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Mandatory\tCHS100\tSifues is old school. It is diffucult to understand him however he will help you if you ask.\t08/30/2005\tN/A \t F\t1.0\t5.0\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS100\tThis is the worst profesor I have evr had vey unclear, and unorganized. Don't take him he is super boring!! His lectures are stupid!! He makes no sense if you read u will be fine good luck.\t07/04/2005\tN/A \t N/A\t1.0\t1.0\t100020\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201202\tNo Comments\t06/28/2005\tN/A \t N/A\t1.0\t1.5\t100020\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tHe is really hard to understand, but if you read the book and participate in class you will be fine. You write an essay for each book (6) and he gives you a study guide for the midterm/final which is exactly what he uses for the exams.\t06/05/2005\tN/A \t N/A\t1.0\t2.0\t100020\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\t201\tHe is one of the best, influential professors I have ever had. Great Professor.\t05/27/2005\tN/A \t N/A\t2.0\t5.0\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tRead do your essays on time, participate=A and youl learn alot. I recommend him.\t02/01/2005\tN/A \t N/A\t2.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS202351\tHe makes you realize that ChS classes are not easy His books are literary masterpieces, this means that they are hard He picks on you if you seem to know the answer or don't know the answer. He has kicked out students that don't read, he scared you into knowing your stuff. He is an overall cool cat.\t01/27/2005\tN/A \t N/A\t5.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tSifuentes was by far one of the most unique professors ever. He is very nice and makes the class very interesting. He loves what he does and he gives it his best. The overall work is very easy if you attend class regularly and do the reading. I highly recommend him for a real learning experience.\t01/14/2005\tN/A \t N/A\t1.0\t5.0\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tSifuentes is a nice guy. There is a lot of reading! Although the books are a little confusing, they are good books. Be ready for 5 page papers every 2-3 weeks. other than that, he is a cool teacher. and funny!!\t12/15/2004\tN/A \t N/A\t2.0\t3.5\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tThis professor is the best!! He is so funny and kooky. If you take this class make sure to get him. He is not so hard if you pay attention\t12/07/2004\tN/A \t N/A\t3.0\t4.0\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tthis professor is nutts but cool!! he is funny and can also bore you to death..he will pick on you like there is no tomorrow and u will be the spotlight. if u are a shy person prepare to loosen up! there are about 10 books throughout the semester and they are so f*** confusing. above all hes sweet!\t11/15/2004\tN/A \t N/A\t2.0\t5.0\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHST\tHe is very unorganized, and most classes are spend reading alod from assigned reading pages, and answering his questions. He sometimes repeats lectures, or aks you to read things that hell never talk about, or test you on things he never talked about.\t09/01/2004\tN/A \t N/A\t4.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS100\tVery unorganized, boring, tests were not what we had studied, does pick on students so watch out! He doesn't move on to the next person, he waits until you say something! GOOD LUCK!\t08/27/2004\tN/A \t N/A\t5.0\t1.0\t100020\tawful\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tLectures were very unorganized, and if he picks on you, say something, or he'll wait and tell you to leave the class, find the answer, and be ready with the answer the next class meeting. The midterm and final exam has material that was never convered.\t08/19/2004\tN/A \t N/A\t2.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tGot an A....just show up do the work\t06/28/2004\tN/A \t N/A\t1.0\t4.5\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS351\tSifuentes is a great person. He can be sometimes boring but its ok. He is willing to help students if you do not understand what he said. His class is an easy A or B. do the readings& papers and you will definitely pass the class& be ready to participate.\t06/28/2004\tN/A \t N/A\t1.0\t5.0\t100020\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tThis class felt like a lifetime to seat through. Some classes would be in Spanish, which wasn't a good thing since some of the people in the class didn't speak Spanish. He would also pick people to say things and would wait until you have something to say\t06/18/2004\tN/A \t N/A\t3.0\t3.0\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\the is wierd and boring but I got A so no complaints\t06/15/2004\tN/A \t N/A\t1.0\t3.0\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\thaha! this is one weird guy! He's a little &quot;explicit&quot; when discussing material. The class is hard to sit through and if he picks on you...you better have something to say! If you do your work and study for midterm and final you'll be ok!\t06/14/2004\tN/A \t N/A\t2.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tblah! isn't clear about due dates, tells u to study things he never even taught, forgets if he has handed out papers already, gets upset if late consistently, really study for exams or u could easily fail them. has students discuss their papers w/ class.\t06/11/2004\tN/A \t N/A\t3.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS497\tthis guy is all over the place and does not make to much sense. but you dont have to go that much and you can still get an A and is very easy grader.\t05/19/2004\tN/A \t N/A\t3.0\t3.0\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tHe is very disorganized and hard to understand. The books are interesting but the class overall is not. It's easy to get a good grade but sitting through that class is torture.\t04/21/2004\tN/A \t N/A\t2.0\t1.5\t100020\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS\tHe has a lot of knowledge though he sometimes finds it hard to transmit it to his students. He may not be the most organized prof., but if you do the class readings and assignments, you'll have no problems at the end of the semester. Take his class.\t07/24/2003\tN/A \t N/A\t2.0\t3.0\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS131\tLoved to discuss his recent book. Exams had nothing to do with it.\t05/25/2003\tN/A \t N/A\t3.0\t3.0\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS201\tPretty straighforward and he gave me an A even though I only went half the time to class. You'll be ok as long as you do your work and readings. Besides how can you complaint when a professor gives you the option to either have a take home or in class exa\t05/06/2003\tN/A \t N/A\t2.0\t3.5\t100020\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS202\tNo Comments\t12/20/2002\tN/A \t N/A\t4.0\t2.0\t100020\tpoor\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tCHS202\tBoring lectures, assigns paper worth 50% of grade, take home final, not organizd\t12/15/2002\tN/A \t N/A\t3.0\t2.5\t100020\taverage\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t Not Mandatory\tHFT4277\tTaking her online now for HFT4277, awesome class and even better professor!!! As long as you keep up with your work and answer questions in detail it will be a very easy A, the work itself isn't hard at all! Just make sure you read the book/lectures! Hate online classes but would recommend taking her to anyone!\t06/07/2017\t Yes\t A+\t1.0\t5.0\t100021\tawesome\tWrappedArray(CLEAR GRADING CRITERIA, AMAZING LECTURES)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tHFT4277\tJill has been in the industry for a while now and is somebody that you could really gain a lot from. There are a few assignments in this class which required the book, but there is one in the library that you can rent out for an hour to do the assignment. Tests are online, and she encourages you to use your book and notes! TAKE HER! SHE ROCKS\t12/10/2016\t Yes\t A-\t1.0\t5.0\t100021\tawesome\tWrappedArray(ACCESSIBLE OUTSIDE CLASS, RESPECTED, CARING)\t Yes\t0\t1\t Yes\nnull\t Mandatory\tHFT4277\tShe is a great professor. I took the class which was mixed mode.  Grade is made up of a few things: attendance (taken randomly), 2 tests (use the book and you'll pass), and a few discussions which are short and easy. She will help you with anything, even tell you how to get a job in the club industry. She has a lot of real life experience!\t11/30/2016\t Yes\t A\t2.0\t5.0\t100021\tawesome\tWrappedArray(INSPIRATIONAL, ACCESSIBLE OUTSIDE CLASS)\t Yes\t0\t0\t Yes\nnull\t Mandatory\tHFT4277\tEasy A. Pretty boring, try to take online.\t05/01/2016\t Yes\t A-\t1.0\t3.5\t100021\tgood\tWrappedArray(CLEAR GRADING CRITERIA)\t Yes\t0\t0\t Yes\nnull\t N/A\tHFT4277\tShe has long and sometimes boring lectures, but she truly cares for her students and wants them to succeed.  She will sometimes extend assignments when students are having trouble or forget to do them. She took attendance about five random times.\t04/23/2016\t Yes\t A\t1.0\t3.5\t100021\tgood\tWrappedArray(LECTURE HEAVY)\t No\t0\t0\t Yes\nnull\t Mandatory\tHFT4277\tDr. Fjelstul is one of the best professors at Rosen! She really understands that students also have jobs and assigns very little hw and only 2 exam (midterm and final). She has a large knowledge of our industry and really wants to see students excel after graduation. Midterm and final both open book open note so rent the book to save some points.\t11/16/2015\t Yes\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray(CLEAR GRADING CRITERIA, CARING)\t Yes\t0\t1\t Yes\nnull\t N/A\t3353\tFirst off, she's an amazing professor. Knows all about golf and teaches from personal knowledge and not a book. No book, one test, EASY assignments, one small project. If you show up and take some notes, you'll pass, easy as that. As a positive, you actually learn in her class. She definitely cares about her students and it shows.\t12/18/2014\t Yes\t N/A\t1.0\t4.5\t100021\tawesome\tWrappedArray(RESPECTED)\t No\t1\t0\t Yes\nnull\t Mandatory\tHFT4277\tSuch an easy and interesting class! Took her mixed mode class. Gives power points that aren't online so you have to come to class. Two tests. 5 assignments (super easy). You take tests in computer labs but they are open book. BUY THE ONLINE BOOK! It will make doing the tests so much easier. There's no way you'll get less than an A in this class\t12/18/2014\t Yes\t A\t2.0\t5.0\t100021\tawesome\tWrappedArray(SKIP CLASS? YOU WON'T PASS., PARTICIPATION MATTERS)\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tThis was a great online class!  Super easy and straightforward. She is very sweet and helpful. She has lots of personal experience. It's not going to be a class you have to worry about; it doesn't require a lot of time each week. I appreciated having an easy, no worries online class!\t12/14/2013\t Yes\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tVery easy and relaxing class. Actually pretty interesting to learn about the club industry. You get points for online quizzes and attendance. Book definitely helps, but not required (as there's an online one for free via google or you can rent one in the library) Highly recommended class for an easy A\t05/03/2012\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tEasy A, no test, exams & best no final exmas. U do have quizzes 10 qst every 2 weeks but easy. U need ur book because sometimes u don't find all the answers in her PP. U don't take her there goes ur A flying out the door. Prof is great! 25pnts for showing up to class, u never know which day she'll take attendance. Y not show to class?\t04/19/2012\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tEasy class, decently interesting, big hearted teacher.\t04/17/2012\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFTGOLF\tOne of the easiest class at Rosen. It is a joke like HFT1000 and cannot get easier an pointless than this. I've learned more about club management by playing golf (once a month).\t08/27/2011\t N/A\t N/A\t1.0\t2.5\t100021\taverage\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tHFT4277\tShe was nice enough but it was impossible to sit through her boring class. Tests were super easy and honestly going to class didn't help me at all. I like her as a person but I won't take another one of her classes.\t07/24/2011\t N/A\t N/A\t1.0\t3.5\t100021\tgood\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tPretty Darn Easy.  She has some experience in the club industry which is interesting to hear about and while much of the discussion is around things you know in other classes there are some new things to be learned.\t05/28/2010\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tGOLFCC\tBest teacher ever. So easy. She has such a big heart and will help you out no matter what. She wants you to do well! I had her for 2 classes in the summer and they were so easy. I'm going to miss her! I wish my classes with her were more than 6 weeks long.\t06/26/2009\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tI took the mixed mode class which was great! I enjoyed this class. Not stressful at all! Country Clubs are pretty interesting.\t04/10/2009\t N/A\t N/A\t1.0\t4.5\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tClass was super easy, took the Mix mode class so most of the stuff is online, an easy presentation on a club of your choice.  Nice elective, you also get to go on some tours of clubs you never would have been aloud in otherwise\t11/18/2008\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\thad her for yacht city and country club management. awesome teacher, def recommend.\t10/14/2008\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\ti had the mixed mode. it was easy. great lady. nice, funny, and understanding. i wish i could take all of my classes w/ her!  textbook is actually useful; i'm keeping it!\t08/21/2008\t N/A\t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t1\t N/A\nnull\t N/A\tGOLFHFT\tShe is awesome!!! So nice and knowledgable. The guest speakers and tour of the golf courses are real interesting. Definately take her!!!\t05/01/2008\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tHFT4277\tGreat Professor and Awesome Class!!!! She is one of my favorites:) Take it!!!\t12/03/2007\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tHFT4277\tOverall the class is very easy, just some group projects, tours, guest speakers, attendance, and a final. She gives you a great perspective on yacht, country, and city club industry. You get tour exclusive clubs and listen to guest speakers from different areas of the club industry.\t08/08/2007\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tHFT1357\tThis class was fantastic. It is not hard at all, you have a few group projects and you have to do a few field trips on your own time, but you will learn so much about the industry if you just listen. Great class!\t04/27/2007\tN/A \t N/A\t2.0\t5.0\t100021\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t Mandatory\tHFTCLUBMGMT\tNo Comments\t12/14/2005\tN/A \t B+\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tBEGINNINGGOLF\tThe instructor is very nice and interested in her students learning. The class promises an easy A as long as you attend. However, the class may not seem worth it because you rarely meet and sometimes class is cancelled.\t07/17/2005\tN/A \t N/A\t2.0\t3.5\t100021\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPEL2122\tAwesome class, she really helps with golf..If you cant make it to class, you can just go to the range on your own. Nice and fun, you can skip right to intermediate, even beginners...just call her.\t01/01/2005\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tBEGINGOLF\tAwesome awesome class. Attendance based and could make up absences. Two tests - very easy. Very nice teacher and very easy class.\t04/27/2003\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tPEL2121\tEasiest two credits you can ever get. Its a joke. Like golf even better\t12/15/2002\tN/A \t N/A\t1.0\t5.0\t100021\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMKTG5553\tJeff Murray is the quintessential professor... the kind we have grown accustomed to seeing in films.  He is highly involved, thought provoking, inspiring.  He encourages creativity and is most concerned with seeing students grow and stretch themselves beyond their current limits.  Anyone would be lucky to study under Jeff. I highly recommend him.\t12/23/2009\t N/A\t N/A\t3.0\t4.5\t100023\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tMKT122\tHe's an awesome professor, Best teacher I have ever had, I had other prof's who had made marketing seem so boring, but Prof Murray changed it all for me. I love Marketing now!! I wish he taught all the courses, he's the best!\t11/04/2008\t N/A\t N/A\t1.0\t5.0\t100023\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tMKTSSECT\tVery interesting teacher, taking notes are a must, Really study for the first test because you may not take it as serious as you should. An A is very possible if you take good notes, not a hard class at all.\t12/15/2006\t N/A\t N/A\t2.0\t4.5\t100023\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tWCOB2013\tgood teacher... a little out of it sometimes\t11/25/2006\t N/A\t N/A\t3.0\t4.5\t100023\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tWCOB2013\tvery straightforward. tells you exactly what to expect. first test i tough cuz it seems like it will be an easy class. then you get used to his test questions. most questions from his lecture take good notes.\t10/20/2006\t N/A\t N/A\t3.0\t5.0\t100023\tawesome\tWrappedArray()\t No\t0\t0\t N/A\nnull\t N/A\tWCOB2013\tJeff is a fantastic teacher. He is genuinely intelligent and created the Markets & Consumers curriculum. A really nice guy who doesn't mind giving A's.\t10/18/2006\t N/A\t N/A\t2.0\t5.0\t100023\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMKTS01\tThis is possibly one of the best teachers in the biz college.  He really knows his stuff and loves teaching the class.  This class is already easy by itself, but he makes it interesting and fun.  EASY A if you go to class!\t09/25/2006\t N/A\t N/A\t2.0\t5.0\t100023\tawesome\tWrappedArray()\t Yes\t0\t0\t N/A\nnull\t N/A\tMKTSANDCONS\tGood teacher who knows what he's talking about.  The tests are a little hard though so study the notes and the vocab in the book.\t08/11/2006\t N/A\t N/A\t4.0\t4.0\t100023\tgood\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMC\tvery easy class.  he's a very intesting person and he's got lots of enthusiasm.  the final is easy too.  just study your notes that you take in class and some of the key terms from the readings in the book.  it does help to read the readings before class (so you know what he's talking about) but it's not necessary.\t05/22/2006\t N/A\t N/A\t1.0\t5.0\t100023\tawesome\tWrappedArray()\t N/A\t1\t0\t N/A\nnull\t N/A\tMRKTSCNSMRS\tAmazing professor! Take Murray at all costs!  He is the department head so 90% of the questions on the final come STRAIGHT from his exams!  Just go to his office and copy your tests for the final, you will ACE it.  He knows his stuff and makes the class really interesting.\t05/12/2006\t N/A\t N/A\t1.0\t5.0\t100023\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMKTSCONSUMER\tI wish this guy taught all my classes.\t05/11/2006\t N/A\t N/A\t1.0\t5.0\t100023\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMRKTSANDCONSM\tgood lectures, take a full set of notes.  Oh! and study the flippin bold face vocab from the book! other than that, good teacher and easy course.  If you dont make an A on your company report, you should seriously drop out of school and shoot yourself because the class average was a 49/50.\t02/03/2006\t N/A\t N/A\t1.0\t5.0\t100023\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A\nnull\t N/A\tMARKETCONSUMER\tTest are really hard but he will help you out as much as you need. A great teacher and treats you very fairly!\t12/10/2005\t N/A\t N/A\t3.0\t4.5\t100023\tawesome\tWrappedArray()\t N/A\t0\t0\t N/A"},{"type":"HTML","data":"<div class=\"result-alert alert-warning\" role=\"alert\"><button type=\"button\" class=\"close\" data-dismiss=\"alert\" aria-label=\"Close\"><span aria-hidden=\"true\">&times;</span></button><strong>Output is truncated</strong> to 102400 bytes. Learn more about <strong>ZEPPELIN_INTERPRETER_OUTPUT_LIMIT</strong></div>"}]},"runtimeInfos":{"jobUrl":{"propertyName":"jobUrl","label":"SPARK JOB","tooltip":"View in Spark web UI","group":"spark","values":["http://10.0.1.109:4040/jobs/job?id=10"],"interpreterSettingId":"spark"}}},{"text":"%pyspark\ndf.printSchema()","user":"anonymous","dateUpdated":"2018-07-30T22:28:27-0400","config":{"colWidth":6,"fontSize":9,"enabled":true,"results":{"0":{"graph":{"mode":"table","height":315.85,"optionOpen":false}}},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"root\n |-- _corrupt_record: string (nullable = true)\n |-- attendence: string (nullable = true)\n |-- class_names: string (nullable = true)\n |-- comments: string (nullable = true)\n |-- date: string (nullable = true)\n |-- for_credits: string (nullable = true)\n |-- grades_revieved: string (nullable = true)\n |-- level_of_difficulty: string (nullable = true)\n |-- overall_quality: string (nullable = true)\n |-- prof_id: long (nullable = true)\n |-- rating_type: string (nullable = true)\n |-- tags_by_user: array (nullable = true)\n |    |-- element: string (containsNull = true)\n |-- textbook_used: string (nullable = true)\n |-- thumbs_down: string (nullable = true)\n |-- thumbs_up: string (nullable = true)\n |-- would_take_again: string (nullable = true)\n\n"}]},"apps":[],"jobName":"paragraph_1532802798925_-1863649204","id":"20180728-143318_1762323921","dateCreated":"2018-07-28T14:33:18-0400","dateStarted":"2018-07-28T22:52:54-0400","dateFinished":"2018-07-28T22:52:54-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8037"},{"text":"%pyspark\ndf.describe().show()","user":"anonymous","dateUpdated":"2018-07-28T22:52:54-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"+-------+--------------------+--------------+--------------------+--------------------+----------+-----------+---------------+-------------------+------------------+------------------+-----------+-------------+-------------------+------------------+----------------+\n|summary|     _corrupt_record|    attendence|         class_names|            comments|      date|for_credits|grades_revieved|level_of_difficulty|   overall_quality|           prof_id|rating_type|textbook_used|        thumbs_down|         thumbs_up|would_take_again|\n+-------+--------------------+--------------+--------------------+--------------------+----------+-----------+---------------+-------------------+------------------+------------------+-----------+-------------+-------------------+------------------+----------------+\n|  count|                   2|        183185|              183185|              183185|    183185|     183185|         183185|             183185|            183185|            183185|     183185|       183185|             183185|            183185|          183185|\n|   mean|                null|          null| 9.613437220924631E8|  142889.57142857142|      null|       null|           null| 2.9659415345142888|3.6128231023282473|105712.86881567814|       null|         null|0.17755274722275297|0.2545131970412425|            null|\n| stddev|                null|          null|1.811405202067163...|  377949.73607075366|      null|       null|           null| 1.3010736117535993|1.4467899827233413|  3153.62764119124|       null|         null|  2.127846848008638|1.5649755805247567|            null|\n|    min|[{\"prof_id\": 1000...|     Mandatory|                   0|                    |01/01/2003|        N/A|              A|                1.0|               1.0|            100001|    average|          N/A|                  0|                 0|             N/A|\n|    max|                   ]| Not Mandatory|          ZOOLOGY225|김교수님께서는 좋아요! 나는 한...|12/31/2017|       Yes |             WD|                5.0|               5.0|            110993|       poor|          Yes|                 95|                 9|             Yes|\n+-------+--------------------+--------------+--------------------+--------------------+----------+-----------+---------------+-------------------+------------------+------------------+-----------+-------------+-------------------+------------------+----------------+\n\n"}]},"apps":[],"jobName":"paragraph_1532817601765_-362966896","id":"20180728-184001_894968235","dateCreated":"2018-07-28T18:40:01-0400","dateStarted":"2018-07-28T22:52:54-0400","dateFinished":"2018-07-28T22:52:58-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8038"},{"text":"%pyspark\nprof_review_count = df.groupby('prof_id').count()","user":"anonymous","dateUpdated":"2018-07-31T00:46:18-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532817707474_532877372","id":"20180728-184147_1907230023","dateCreated":"2018-07-28T18:41:47-0400","dateStarted":"2018-07-31T00:46:18-0400","dateFinished":"2018-07-31T00:46:18-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8039"},{"text":"%pyspark\ntotal_reviews = prof_review_count.count()\nlessthan10 = prof_review_count.filter(prof_review_count['count'] < 10).count()\nprint('Professors with more than 10 reviews: {}\\t{:.2f}%'.format(total_reviews-lessthan10, \n                                                            (total_reviews-lessthan10)/total_reviews*100))","user":"anonymous","dateUpdated":"2018-07-31T00:49:09-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"Professors with more than 10 reviews: 4518\t75.60%\n"}]},"apps":[],"jobName":"paragraph_1532817854252_-1540030536","id":"20180728-184414_1226690251","dateCreated":"2018-07-28T18:44:14-0400","dateStarted":"2018-07-31T00:49:09-0400","dateFinished":"2018-07-31T00:49:11-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8040","runtimeInfos":{"jobUrl":{"propertyName":"jobUrl","label":"SPARK JOB","tooltip":"View in Spark web UI","group":"spark","values":["http://10.0.1.109:4040/jobs/job?id=16","http://10.0.1.109:4040/jobs/job?id=17"],"interpreterSettingId":"spark"}}},{"text":"%pyspark\ngrade_count = df.groupby('grades_revieved').count()\ngrade_count.show()","user":"anonymous","dateUpdated":"2018-07-28T22:43:58-0400","config":{"colWidth":11,"fontSize":9,"enabled":true,"results":{"0":{"graph":{"mode":"table","height":428,"optionOpen":false}}},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"+---------------+------+\n|grades_revieved| count|\n+---------------+------+\n|   Not sure yet|  1028|\n|            INC|   110|\n|             B-|   589|\n|           null|     2|\n|             WD|   373|\n|             C-|   207|\n|              C|   741|\n|             B+|  1962|\n|             D+|   101|\n|             D-|    44|\n|             A-|  1763|\n| Audit/No Grade|    22|\n|              B|  2153|\n|              A|  6398|\n|              F|   218|\n|            N/A|164295|\n|              D|   203|\n|             C+|   532|\n|              P|    74|\n|             A+|  2372|\n+---------------+------+\n\n"}]},"apps":[],"jobName":"paragraph_1532818089762_487414440","id":"20180728-184809_506309312","dateCreated":"2018-07-28T18:48:09-0400","dateStarted":"2018-07-28T22:43:45-0400","dateFinished":"2018-07-28T22:43:46-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8041"},{"text":"Look at distribution of overall quality groupby grades recieved\n- compare to the distribution of overall quality\nLook at comment length vs grade recieved\nLook at comment length vs overall quality\nLook at comment length vs overall difficulity\nLook at comment overall quality vs level of dificulity\nAverage overall quality over time.\n- what characteristics are associated with professors whose overall quality increases, decreases over time or stays the same.\nMost associted keywords with thumbs up/down\nDistribution of overall quality for thumbs up/down\nDistribution of comment length for thumbs up/down","user":"anonymous","dateUpdated":"2018-07-28T21:06:33-0400","config":{"colWidth":12,"fontSize":10,"enabled":false,"results":{},"editorSetting":{"language":"scala","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/scala","lineNumbers":false,"tableHide":true},"settings":{"params":{},"forms":{}},"apps":[],"jobName":"paragraph_1532819765050_1794910426","id":"20180728-191605_1368311446","dateCreated":"2018-07-28T19:16:05-0400","dateStarted":"2018-07-28T19:58:44-0400","dateFinished":"2018-07-28T19:58:44-0400","status":"READY","errorMessage":"","progressUpdateIntervalMs":500,"$$hashKey":"object:8042"},{"text":"%pyspark\nfrom pyspark.sql.functions import *","user":"anonymous","dateUpdated":"2018-07-28T22:59:26-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532819094477_-1303802247","id":"20180728-190454_1363546601","dateCreated":"2018-07-28T19:04:54-0400","dateStarted":"2018-07-28T22:59:26-0400","dateFinished":"2018-07-28T22:59:26-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8043"},{"text":"%pyspark\ndf2 = df.withColumn('grade', ltrim(df['grades_revieved']))","user":"anonymous","dateUpdated":"2018-07-28T22:47:45-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"DataFrame[_corrupt_record: string, attendence: string, class_names: string, comments: string, date: string, for_credits: string, grades_revieved: string, level_of_difficulty: string, overall_quality: string, prof_id: bigint, rating_type: string, tags_by_user: array<string>, textbook_used: string, thumbs_down: string, thumbs_up: string, would_take_again: string, grade: string]\n"}]},"apps":[],"jobName":"paragraph_1532832281838_-2106246007","id":"20180728-224441_1985403609","dateCreated":"2018-07-28T22:44:41-0400","dateStarted":"2018-07-28T22:47:24-0400","dateFinished":"2018-07-28T22:47:24-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8044"},{"text":"%pyspark\ndf2.head(3)[0]","user":"anonymous","dateUpdated":"2018-07-28T22:45:25-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"Row(_corrupt_record='[{\"prof_id\": 100001, \"date\": \"12/14/2017\", \"rating_type\": \"good\", \"overall_quality\": \"4.0\", \"level_of_difficulty\": \"3.0\", \"class_names\": \"SOC106\", \"for_credits\": \" Yes\", \"attendence\": \" Mandatory\", \"textbook_used\": \" No\", \"would_take_again\": \" Yes\", \"grades_revieved\": \" N/A\", \"tags_by_user\": [\"CARING\", \"RESPECTED\", \"GET READY TO READ\"], \"comments\": \"Clawson is really caring and interested in his students so it\\'s an easy class to pass, although there is A LOT of reading which is important to quizzes (a pretty big part of your grade) and the final exam. There\\'s a big paper but its very doable and Dan is very easy to work with. Lectures get a bit tedious but can be though provoking\", \"thumbs_up\": \"0\", \"thumbs_down\": \"0\"},', attendence=None, class_names=None, comments=None, date=None, for_credits=None, grades_revieved=None, level_of_difficulty=None, overall_quality=None, prof_id=None, rating_type=None, tags_by_user=None, textbook_used=None, thumbs_down=None, thumbs_up=None, would_take_again=None, grade=None)\n"}]},"apps":[],"jobName":"paragraph_1532832296259_974067884","id":"20180728-224456_1949132521","dateCreated":"2018-07-28T22:44:56-0400","dateStarted":"2018-07-28T22:45:25-0400","dateFinished":"2018-07-28T22:45:26-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8045"},{"text":"%pyspark\ndf2.printSchema()","user":"anonymous","dateUpdated":"2018-07-28T22:53:25-0400","config":{"colWidth":11,"fontSize":9,"enabled":true,"results":{"0":{"graph":{"mode":"table","height":354,"optionOpen":false}}},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"root\n |-- _corrupt_record: string (nullable = true)\n |-- attendence: string (nullable = true)\n |-- class_names: string (nullable = true)\n |-- comments: string (nullable = true)\n |-- date: string (nullable = true)\n |-- for_credits: string (nullable = true)\n |-- grades_revieved: string (nullable = true)\n |-- level_of_difficulty: string (nullable = true)\n |-- overall_quality: string (nullable = true)\n |-- prof_id: long (nullable = true)\n |-- rating_type: string (nullable = true)\n |-- tags_by_user: array (nullable = true)\n |    |-- element: string (containsNull = true)\n |-- textbook_used: string (nullable = true)\n |-- thumbs_down: string (nullable = true)\n |-- thumbs_up: string (nullable = true)\n |-- would_take_again: string (nullable = true)\n |-- grade: string (nullable = true)\n\n"}]},"apps":[],"jobName":"paragraph_1532832356843_115883293","id":"20180728-224556_96947144","dateCreated":"2018-07-28T22:45:56-0400","dateStarted":"2018-07-28T22:46:41-0400","dateFinished":"2018-07-28T22:46:41-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8046"},{"text":"%pyspark\nfrom pyspark.sql.functions import col, size\n\ndf.where(size(col(\"tags_by_user\")) > 3).show()","user":"anonymous","dateUpdated":"2018-07-28T23:54:53-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"+---------------+----------+-----------+--------+----+-----------+---------------+-------------------+---------------+-------+-----------+------------+-------------+-----------+---------+----------------+\n|_corrupt_record|attendence|class_names|comments|date|for_credits|grades_revieved|level_of_difficulty|overall_quality|prof_id|rating_type|tags_by_user|textbook_used|thumbs_down|thumbs_up|would_take_again|\n+---------------+----------+-----------+--------+----+-----------+---------------+-------------------+---------------+-------+-----------+------------+-------------+-----------+---------+----------------+\n+---------------+----------+-----------+--------+----+-----------+---------------+-------------------+---------------+-------+-----------+------------+-------------+-----------+---------+----------------+\n\n"}]},"apps":[],"jobName":"paragraph_1532836239842_-1334687281","id":"20180728-235039_541310353","dateCreated":"2018-07-28T23:50:39-0400","dateStarted":"2018-07-28T23:54:53-0400","dateFinished":"2018-07-28T23:54:54-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8047"},{"text":"%pyspark\nfrom pyspark.sql.functions import col, length\n\ndf.where(length(col(\"comments\")) < 99).count()","user":"anonymous","dateUpdated":"2018-07-29T00:00:57-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python","editorHide":false},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"134651\n"}]},"apps":[],"jobName":"paragraph_1532836759613_88031298","id":"20180728-235919_1794975597","dateCreated":"2018-07-28T23:59:19-0400","dateStarted":"2018-07-29T00:00:32-0400","dateFinished":"2018-07-29T00:00:33-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8048"},{"text":"%pyspark\ndf3 = df.withColumn('comment_length', length(df.comments))","user":"anonymous","dateUpdated":"2018-07-29T00:19:00-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532837896248_803171921","id":"20180729-001816_1958379067","dateCreated":"2018-07-29T00:18:16-0400","dateStarted":"2018-07-29T00:19:00-0400","dateFinished":"2018-07-29T00:19:00-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8049"},{"text":"%pyspark\ndf3.show(3)","user":"anonymous","dateUpdated":"2018-07-29T00:19:20-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"+--------------------+--------------+-----------+--------------------+----------+-----------+---------------+-------------------+---------------+-------+-----------+--------------------+-------------+-----------+---------+----------------+--------------+\n|     _corrupt_record|    attendence|class_names|            comments|      date|for_credits|grades_revieved|level_of_difficulty|overall_quality|prof_id|rating_type|        tags_by_user|textbook_used|thumbs_down|thumbs_up|would_take_again|comment_length|\n+--------------------+--------------+-----------+--------------------+----------+-----------+---------------+-------------------+---------------+-------+-----------+--------------------+-------------+-----------+---------+----------------+--------------+\n|[{\"prof_id\": 1000...|          null|       null|                null|      null|       null|           null|               null|           null|   null|       null|                null|         null|       null|     null|            null|          null|\n|                null|     Mandatory|     SOC353|This class was de...|11/15/2017|        N/A|              B|                3.0|            3.0| 100001|    average|[CLEAR GRADING CR...|          Yes|          0|        1|              No|           350|\n|                null| Not Mandatory|     SOC106|This class sucks....|10/16/2017|        Yes|            N/A|                4.0|            1.0| 100001|      awful|                  []|          Yes|          0|        0|              No|            52|\n+--------------------+--------------+-----------+--------------------+----------+-----------+---------------+-------------------+---------------+-------+-----------+--------------------+-------------+-----------+---------+----------------+--------------+\nonly showing top 3 rows\n\n"}]},"apps":[],"jobName":"paragraph_1532837943643_-932271580","id":"20180729-001903_242401551","dateCreated":"2018-07-29T00:19:03-0400","dateStarted":"2018-07-29T00:19:20-0400","dateFinished":"2018-07-29T00:19:20-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8050"},{"text":"%pyspark\ndf3.printSchema()","user":"anonymous","dateUpdated":"2018-07-29T00:19:47-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"root\n |-- _corrupt_record: string (nullable = true)\n |-- attendence: string (nullable = true)\n |-- class_names: string (nullable = true)\n |-- comments: string (nullable = true)\n |-- date: string (nullable = true)\n |-- for_credits: string (nullable = true)\n |-- grades_revieved: string (nullable = true)\n |-- level_of_difficulty: string (nullable = true)\n |-- overall_quality: string (nullable = true)\n |-- prof_id: long (nullable = true)\n |-- rating_type: string (nullable = true)\n |-- tags_by_user: array (nullable = true)\n |    |-- element: string (containsNull = true)\n |-- textbook_used: string (nullable = true)\n |-- thumbs_down: string (nullable = true)\n |-- thumbs_up: string (nullable = true)\n |-- would_take_again: string (nullable = true)\n |-- comment_length: integer (nullable = true)\n\n"}]},"apps":[],"jobName":"paragraph_1532837973855_1772327404","id":"20180729-001933_529331656","dateCreated":"2018-07-29T00:19:33-0400","dateStarted":"2018-07-29T00:19:47-0400","dateFinished":"2018-07-29T00:19:47-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8051"},{"text":"Code bellow does not work - maybe only work with numbers?","user":"anonymous","dateUpdated":"2018-07-28T23:43:29-0400","config":{"colWidth":12,"fontSize":9,"enabled":false,"results":{},"editorSetting":{"language":"scala","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/scala"},"settings":{"params":{},"forms":{}},"apps":[],"jobName":"paragraph_1532835748678_-314301490","id":"20180728-234228_2100833444","dateCreated":"2018-07-28T23:42:28-0400","status":"READY","progressUpdateIntervalMs":500,"$$hashKey":"object:8052"},{"text":"%pyspark\nfrom pyspark.sql.types import IntegerType\nfrom pyspark.sql.functions import udf\n\nslen = udf(lambda s: len(s), IntegerType())\n\ndf3 = df.withColumn('comment_length', slen(df.comments))","user":"anonymous","dateUpdated":"2018-07-28T23:49:06-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532833534112_-1657754495","id":"20180728-230534_1799596750","dateCreated":"2018-07-28T23:05:34-0400","dateStarted":"2018-07-28T23:48:44-0400","dateFinished":"2018-07-28T23:48:44-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8053"},{"text":"%pyspark\ndf3.select('comment_length').show(5)","user":"anonymous","dateUpdated":"2018-07-28T23:49:39-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"+--------------------+\n|            comments|\n+--------------------+\n|                null|\n|This class was de...|\n|This class sucks....|\n|Dan is best. I re...|\n|Wonderful profess...|\n+--------------------+\nonly showing top 5 rows\n\n"}]},"apps":[],"jobName":"paragraph_1532836020288_436397205","id":"20180728-234700_1791603575","dateCreated":"2018-07-28T23:47:00-0400","dateStarted":"2018-07-28T23:49:19-0400","dateFinished":"2018-07-28T23:49:19-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8054"},{"text":"%pyspark\nfrom pyspark.sql.functions import udf","user":"anonymous","dateUpdated":"2018-07-28T23:13:56-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532834015113_1118221241","id":"20180728-231335_1511171690","dateCreated":"2018-07-28T23:13:35-0400","dateStarted":"2018-07-28T23:13:56-0400","dateFinished":"2018-07-28T23:13:56-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8055"},{"text":"%pyspark\nfrom pyspark.sql.functions import udf\n\n# Use udf to define a row-at-a-time udf\n@udf('string')\n# Input/output are both a single double value\ndef get_comment_length(comment):\n      return str(len(comment))","user":"anonymous","dateUpdated":"2018-07-29T00:11:45-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532834032061_-909168590","id":"20180728-231352_604184546","dateCreated":"2018-07-28T23:13:52-0400","dateStarted":"2018-07-29T00:11:45-0400","dateFinished":"2018-07-29T00:11:45-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8056"},{"text":"%pyspark\ndf.count()","user":"anonymous","dateUpdated":"2018-07-29T00:16:32-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"183187\n"}]},"apps":[],"jobName":"paragraph_1532837747908_1446422959","id":"20180729-001547_1342224518","dateCreated":"2018-07-29T00:15:47-0400","dateStarted":"2018-07-29T00:16:32-0400","dateFinished":"2018-07-29T00:16:32-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8057"},{"text":"%pyspark\ndf.na.drop().count()","user":"anonymous","dateUpdated":"2018-07-29T00:17:07-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"0\n"}]},"apps":[],"jobName":"paragraph_1532837798079_697556357","id":"20180729-001638_589730599","dateCreated":"2018-07-29T00:16:38-0400","dateStarted":"2018-07-29T00:17:07-0400","dateFinished":"2018-07-29T00:17:08-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8058"},{"text":"%pyspark\ntype(df.select())","user":"anonymous","dateUpdated":"2018-07-29T00:14:46-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"<class 'pyspark.sql.dataframe.DataFrame'>\n"}]},"apps":[],"jobName":"paragraph_1532837573321_1936904293","id":"20180729-001253_688336285","dateCreated":"2018-07-29T00:12:53-0400","dateStarted":"2018-07-29T00:14:46-0400","dateFinished":"2018-07-29T00:14:46-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8059"},{"text":"%pyspark\ndf3 = df.withColumn('comment_length', get_comment_length(df['comments']))","user":"anonymous","dateUpdated":"2018-07-29T00:12:00-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[]},"apps":[],"jobName":"paragraph_1532834297865_1094810566","id":"20180728-231817_1702076878","dateCreated":"2018-07-28T23:18:17-0400","dateStarted":"2018-07-29T00:12:00-0400","dateFinished":"2018-07-29T00:12:00-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8060"},{"text":"%pyspark\ndf3.show(1)","user":"anonymous","dateUpdated":"2018-07-29T00:12:04-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"ERROR","msg":[{"type":"TEXT","data":"Py4JJavaError: An error occurred while calling o1177.showString.\n: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 112.0 failed 1 times, most recent failure: Lost task 0.0 in stage 112.0 (TID 3585, localhost, executor driver): org.apache.spark.api.python.PythonException: Traceback (most recent call last):\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 230, in main\n    process()\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 225, in process\n    serializer.dump_stream(func(split_index, iterator), outfile)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 324, in dump_stream\n    self.serializer.dump_stream(self._batched(iterator), stream)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 139, in dump_stream\n    for obj in iterator:\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 313, in _batched\n    for item in iterator:\n  File \"<string>\", line 1, in <lambda>\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 75, in <lambda>\n    return lambda *a: f(*a)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/util.py\", line 55, in wrapper\n  File \"<stdin>\", line 7, in get_comment_length\nTypeError: object of type 'NoneType' has no len()\n\n\tat org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:298)\n\tat org.apache.spark.sql.execution.python.PythonUDFRunner$$anon$1.read(PythonUDFRunner.scala:83)\n\tat org.apache.spark.sql.execution.python.PythonUDFRunner$$anon$1.read(PythonUDFRunner.scala:66)\n\tat org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:252)\n\tat org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)\n\tat scala.collection.Iterator$$anon$12.hasNext(Iterator.scala:439)\n\tat scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:408)\n\tat scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:408)\n\tat org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage2.processNext(Unknown Source)\n\tat org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)\n\tat org.apache.spark.sql.execution.WholeStageCodegenExec$$anonfun$10$$anon$1.hasNext(WholeStageCodegenExec.scala:614)\n\tat org.apache.spark.sql.execution.SparkPlan$$anonfun$2.apply(SparkPlan.scala:253)\n\tat org.apache.spark.sql.execution.SparkPlan$$anonfun$2.apply(SparkPlan.scala:247)\n\tat org.apache.spark.rdd.RDD$$anonfun$mapPartitionsInternal$1$$anonfun$apply$25.apply(RDD.scala:830)\n\tat org.apache.spark.rdd.RDD$$anonfun$mapPartitionsInternal$1$$anonfun$apply$25.apply(RDD.scala:830)\n\tat org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:38)\n\tat org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:324)\n\tat org.apache.spark.rdd.RDD.iterator(RDD.scala:288)\n\tat org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:38)\n\tat org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:324)\n\tat org.apache.spark.rdd.RDD.iterator(RDD.scala:288)\n\tat org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:87)\n\tat org.apache.spark.scheduler.Task.run(Task.scala:109)\n\tat org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:345)\n\tat java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1149)\n\tat java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:624)\n\tat java.lang.Thread.run(Thread.java:748)\n\nDriver stacktrace:\n\tat org.apache.spark.scheduler.DAGScheduler.org$apache$spark$scheduler$DAGScheduler$$failJobAndIndependentStages(DAGScheduler.scala:1602)\n\tat org.apache.spark.scheduler.DAGScheduler$$anonfun$abortStage$1.apply(DAGScheduler.scala:1590)\n\tat org.apache.spark.scheduler.DAGScheduler$$anonfun$abortStage$1.apply(DAGScheduler.scala:1589)\n\tat scala.collection.mutable.ResizableArray$class.foreach(ResizableArray.scala:59)\n\tat scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:48)\n\tat org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:1589)\n\tat org.apache.spark.scheduler.DAGScheduler$$anonfun$handleTaskSetFailed$1.apply(DAGScheduler.scala:831)\n\tat org.apache.spark.scheduler.DAGScheduler$$anonfun$handleTaskSetFailed$1.apply(DAGScheduler.scala:831)\n\tat scala.Option.foreach(Option.scala:257)\n\tat org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:831)\n\tat org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:1823)\n\tat org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:1772)\n\tat org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:1761)\n\tat org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:48)\n\tat org.apache.spark.scheduler.DAGScheduler.runJob(DAGScheduler.scala:642)\n\tat org.apache.spark.SparkContext.runJob(SparkContext.scala:2034)\n\tat org.apache.spark.SparkContext.runJob(SparkContext.scala:2055)\n\tat org.apache.spark.SparkContext.runJob(SparkContext.scala:2074)\n\tat org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:363)\n\tat org.apache.spark.sql.execution.CollectLimitExec.executeCollect(limit.scala:38)\n\tat org.apache.spark.sql.Dataset.org$apache$spark$sql$Dataset$$collectFromPlan(Dataset.scala:3273)\n\tat org.apache.spark.sql.Dataset$$anonfun$head$1.apply(Dataset.scala:2484)\n\tat org.apache.spark.sql.Dataset$$anonfun$head$1.apply(Dataset.scala:2484)\n\tat org.apache.spark.sql.Dataset$$anonfun$52.apply(Dataset.scala:3254)\n\tat org.apache.spark.sql.execution.SQLExecution$.withNewExecutionId(SQLExecution.scala:77)\n\tat org.apache.spark.sql.Dataset.withAction(Dataset.scala:3253)\n\tat org.apache.spark.sql.Dataset.head(Dataset.scala:2484)\n\tat org.apache.spark.sql.Dataset.take(Dataset.scala:2698)\n\tat org.apache.spark.sql.Dataset.showString(Dataset.scala:254)\n\tat sun.reflect.GeneratedMethodAccessor152.invoke(Unknown Source)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)\n\tat java.lang.reflect.Method.invoke(Method.java:498)\n\tat py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)\n\tat py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)\n\tat py4j.Gateway.invoke(Gateway.java:282)\n\tat py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)\n\tat py4j.commands.CallCommand.execute(CallCommand.java:79)\n\tat py4j.GatewayConnection.run(GatewayConnection.java:238)\n\tat java.lang.Thread.run(Thread.java:748)\nCaused by: org.apache.spark.api.python.PythonException: Traceback (most recent call last):\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 230, in main\n    process()\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 225, in process\n    serializer.dump_stream(func(split_index, iterator), outfile)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 324, in dump_stream\n    self.serializer.dump_stream(self._batched(iterator), stream)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 139, in dump_stream\n    for obj in iterator:\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/serializers.py\", line 313, in _batched\n    for item in iterator:\n  File \"<string>\", line 1, in <lambda>\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/worker.py\", line 75, in <lambda>\n    return lambda *a: f(*a)\n  File \"/home/zafrin/spark-2.3.1-bin-hadoop2.7/python/lib/pyspark.zip/pyspark/util.py\", line 55, in wrapper\n  File \"<stdin>\", line 7, in get_comment_length\nTypeError: object of type 'NoneType' has no len()\n\n\tat org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:298)\n\tat org.apache.spark.sql.execution.python.PythonUDFRunner$$anon$1.read(PythonUDFRunner.scala:83)\n\tat org.apache.spark.sql.execution.python.PythonUDFRunner$$anon$1.read(PythonUDFRunner.scala:66)\n\tat org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:252)\n\tat org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)\n\tat scala.collection.Iterator$$anon$12.hasNext(Iterator.scala:439)\n\tat scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:408)\n\tat scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:408)\n\tat org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage2.processNext(Unknown Source)\n\tat org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)\n\tat org.apache.spark.sql.execution.WholeStageCodegenExec$$anonfun$10$$anon$1.hasNext(WholeStageCodegenExec.scala:614)\n\tat org.apache.spark.sql.execution.SparkPlan$$anonfun$2.apply(SparkPlan.scala:253)\n\tat org.apache.spark.sql.execution.SparkPlan$$anonfun$2.apply(SparkPlan.scala:247)\n\tat org.apache.spark.rdd.RDD$$anonfun$mapPartitionsInternal$1$$anonfun$apply$25.apply(RDD.scala:830)\n\tat org.apache.spark.rdd.RDD$$anonfun$mapPartitionsInternal$1$$anonfun$apply$25.apply(RDD.scala:830)\n\tat org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:38)\n\tat org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:324)\n\tat org.apache.spark.rdd.RDD.iterator(RDD.scala:288)\n\tat org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:38)\n\tat org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:324)\n\tat org.apache.spark.rdd.RDD.iterator(RDD.scala:288)\n\tat org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:87)\n\tat org.apache.spark.scheduler.Task.run(Task.scala:109)\n\tat org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:345)\n\tat java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1149)\n\tat java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:624)\n\t... 1 more\n\n(<class 'py4j.protocol.Py4JJavaError'>, Py4JJavaError('An error occurred while calling o1177.showString.\\n', JavaObject id=o1179), <traceback object at 0x7fe8f2f102c8>)"}]},"apps":[],"jobName":"paragraph_1532834691926_-677531458","id":"20180728-232451_536980061","dateCreated":"2018-07-28T23:24:51-0400","dateStarted":"2018-07-29T00:12:05-0400","dateFinished":"2018-07-29T00:12:05-0400","status":"ERROR","progressUpdateIntervalMs":500,"$$hashKey":"object:8061"},{"text":"%pyspark\ncount = 0\nfor i in df.select('comments').collect():\n    print(i)\n    print(type(i))\n    print(len(i), '\\n')\n    count +=1\n    if count >5: break","user":"anonymous","dateUpdated":"2018-07-28T23:36:05-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"results":{"code":"SUCCESS","msg":[{"type":"TEXT","data":"Row(comments=None)\n<class 'pyspark.sql.types.Row'>\n1 \n\nRow(comments=\"This class was definitely not what I thought it would be. Heavily reading based. If you read the articles you'll be fine and he gives you opportunities to miss some of the reaction papers he assigns. The book essay is a big part of your grade: START IT EARLY! Overall he's an okay teacher but kind of boring and the class is not based on medications.\")\n<class 'pyspark.sql.types.Row'>\n1 \n\nRow(comments=\"This class sucks. don't take it. you will regret it.\")\n<class 'pyspark.sql.types.Row'>\n1 \n\nRow(comments='Dan is best. I really recommend this class if you are interested in the health field or just want an awesome class.')\n<class 'pyspark.sql.types.Row'>\n1 \n\nRow(comments=\"Wonderful professor, inspired great interest in the subject. One of the best professors I've had.\")\n<class 'pyspark.sql.types.Row'>\n1 \n\nRow(comments='Class was ok. Had an option to complete a certain # out of total assignments. Was always pushing deadlines back. He did tell me it was ok to take on a topic that has yet to be researched, went thru ideas for the paper, told me i needed to find research on it on graded last edit? that was a bit annoying. Nice guy. not very interesting. dont avoid')\n<class 'pyspark.sql.types.Row'>\n1 \n\n"}]},"apps":[],"jobName":"paragraph_1532834724219_1650257105","id":"20180728-232524_1354246502","dateCreated":"2018-07-28T23:25:24-0400","dateStarted":"2018-07-28T23:36:05-0400","dateFinished":"2018-07-28T23:36:06-0400","status":"FINISHED","progressUpdateIntervalMs":500,"$$hashKey":"object:8062"},{"text":"%pyspark\n","user":"anonymous","dateUpdated":"2018-07-28T23:31:39-0400","config":{"colWidth":12,"fontSize":9,"enabled":true,"results":{},"editorSetting":{"language":"python","editOnDblClick":false,"completionKey":"TAB","completionSupport":true},"editorMode":"ace/mode/python"},"settings":{"params":{},"forms":{}},"apps":[],"jobName":"paragraph_1532835099376_1827419205","id":"20180728-233139_1015502094","dateCreated":"2018-07-28T23:31:39-0400","status":"READY","progressUpdateIntervalMs":500,"$$hashKey":"object:8063"}],"name":"EDA with Spark Dataframe","id":"2DK5C8GFF","noteParams":{},"noteForms":{},"angularObjects":{"spark:shared_process":[]},"config":{"isZeppelinNotebookCronEnable":false,"looknfeel":"default","personalizedMode":"false"},"info":{}}